Emile666/THD_Analyzer/stm8s105.h
/*==================================================================
  File Name: stm8s105.h
  Author   : Emile
  ------------------------------------------------------------------
  Purpose  : This files contains the register definition for the
             STM8S105 microcontroller.
  ------------------------------------------------------------------
  This file is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This software is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this software. If not, see <http://www.gnu.org/licenses/>.
  ================================================================== */
#ifndef _STH8S105_H_
#define _STH8S105_H_

//------------------------------------------------------------------------
// Set in IAR Project->Options->C/C++ compiler->Defined symbols if the
// default IAR header file should be used. If not defined, this header
// file (stm8s105.h) is used.
//------------------------------------------------------------------------
#if defined(USE_IAR_HEADER_FILE)
   #include <iostm8s105c6.h>
   #include <intrinsics.h>
#else

//------------------------------------------------------------------------
// Interrupt commands specific for SDCC, substitute for IAR intrinsics.h
//------------------------------------------------------------------------
#if defined(__ICCSTM8__)
    #include <intrinsics.h>
#elif defined(__SDCC)
    #define __enable_interrupt()   {__asm__("rim\n");}  /* enable interrupts */
    #define __disable_interrupt()  {__asm__("sim\n");}  /* disable interrupts */
    #define rim()                  {__asm__("rim\n");}  /* enable interrupts */
    #define sim()                  {__asm__("sim\n");}  /* disable interrupts */
    #define __no_operation()       {__asm__("nop\n");}  /* No Operation */
    #define __trap()               {__asm__("trap\n");} /* Trap (soft IT) */
    #define __wait_for_interrupt() {__asm__("wfi\n");}  /* Wait For Interrupt */
    #define __halt()               {__asm__("halt\n");} /* Halt */
#endif

//---------------------------------------------------------------
// Union definitions for all Special Function Registers (SFR).
// Supports both byte-wise access (e.g. PA_ODR = 0) and
// bitwise access (e.g. TIM1_CR2_MMS = 5, sets bits 456 to 101).
//---------------------------------------------------------------
typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit1    : 1;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit4    : 1;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR8;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit1    : 1;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit45   : 2;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR111121;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit1    : 1;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit4    : 1;
      unsigned char bit56   : 2;
      unsigned char bit7    : 1;
    } bits;
} DR1111121;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit1    : 1;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit46   : 3;
      unsigned char bit7    : 1;
    } bits;
} DR111131;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit1    : 1;
      unsigned char bit2    : 1;
      unsigned char bit35   : 3;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR11131;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit12   : 2;
      unsigned char bit3    : 1;
      unsigned char bit4    : 1;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR12;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit14   : 4;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR14;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit0    : 1;
      unsigned char bit17   : 7;
    } bits;
} DR17;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit01   : 2;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit4    : 1;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR21;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit01   : 2;
      unsigned char bit2    : 1;
      unsigned char bit3    : 1;
      unsigned char bit46   : 3;
      unsigned char bit7    : 1;
    } bits;
} DR21131;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit01   : 2;
      unsigned char bit23   : 2;
      unsigned char bit45   : 2;
      unsigned char bit67   : 2;
    } bits;
} DR2222;

