Emile666/THD_Analyzer/stm8s105.h
typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit01   : 2;
      unsigned char bit23   : 2;
      unsigned char bit47   : 4;
    } bits;
} DR224;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit02   : 3;
      unsigned char bit3    : 1;
      unsigned char bit46   : 3;
      unsigned char bit7    : 1;
    } bits;
} DR3131;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit02   : 3;
      unsigned char bit34   : 2;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR321;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit03   : 4;
      unsigned char bit4    : 1;
      unsigned char bit5    : 1;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR41;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit03   : 4;
      unsigned char bit45   : 2;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR42;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit04   : 5;
      unsigned char bit5    : 1;
      unsigned char bit67   : 2;
    } bits;
} DR512;

typedef union {
    unsigned char byte; // bytewise access
    struct {            // bitwise access
      unsigned char bit05   : 6;
      unsigned char bit6    : 1;
      unsigned char bit7    : 1;
    } bits;
} DR61;

//--------------------------------------------------
// General purpose I/O ports (GPIO): PORT A - PORT I
//--------------------------------------------------
#define PPA_ODR     0x5000
#define PA_ODR      (*((volatile DR8*)PPA_ODR)).byte
#define PA_ODR_ODR0 (*((volatile DR8*)PPA_ODR)).bits.bit0
#define PA_ODR_ODR1 (*((volatile DR8*)PPA_ODR)).bits.bit1
#define PA_ODR_ODR2 (*((volatile DR8*)PPA_ODR)).bits.bit2
#define PA_ODR_ODR3 (*((volatile DR8*)PPA_ODR)).bits.bit3
#define PA_ODR_ODR4 (*((volatile DR8*)PPA_ODR)).bits.bit4
#define PA_ODR_ODR5 (*((volatile DR8*)PPA_ODR)).bits.bit5
#define PA_ODR_ODR6 (*((volatile DR8*)PPA_ODR)).bits.bit6
#define PA_ODR_ODR7 (*((volatile DR8*)PPA_ODR)).bits.bit7

#define PPA_IDR     0x5001
#define PA_IDR      (*((volatile DR8*)PPA_IDR)).byte
#define PA_IDR_IDR0 (*((volatile DR8*)PPA_IDR)).bits.bit0
#define PA_IDR_IDR1 (*((volatile DR8*)PPA_IDR)).bits.bit1
#define PA_IDR_IDR2 (*((volatile DR8*)PPA_IDR)).bits.bit2
#define PA_IDR_IDR3 (*((volatile DR8*)PPA_IDR)).bits.bit3
#define PA_IDR_IDR4 (*((volatile DR8*)PPA_IDR)).bits.bit4
#define PA_IDR_IDR5 (*((volatile DR8*)PPA_IDR)).bits.bit5
#define PA_IDR_IDR6 (*((volatile DR8*)PPA_IDR)).bits.bit6
#define PA_IDR_IDR7 (*((volatile DR8*)PPA_IDR)).bits.bit7

#define PPA_DDR     0x5002
#define PA_DDR      (*((volatile DR8*)PPA_DDR)).byte
#define PA_DDR_DDR0 (*((volatile DR8*)PPA_DDR)).bits.bit0
#define PA_DDR_DDR1 (*((volatile DR8*)PPA_DDR)).bits.bit1
#define PA_DDR_DDR2 (*((volatile DR8*)PPA_DDR)).bits.bit2
#define PA_DDR_DDR3 (*((volatile DR8*)PPA_DDR)).bits.bit3
#define PA_DDR_DDR4 (*((volatile DR8*)PPA_DDR)).bits.bit4
#define PA_DDR_DDR5 (*((volatile DR8*)PPA_DDR)).bits.bit5
#define PA_DDR_DDR6 (*((volatile DR8*)PPA_DDR)).bits.bit6
#define PA_DDR_DDR7 (*((volatile DR8*)PPA_DDR)).bits.bit7

#define PPA_CR1     0x5003
#define PA_CR1      (*((volatile DR8*)PPA_CR1)).byte
#define PA_CR1_C10  (*((volatile DR8*)PPA_CR1)).bits.bit0
#define PA_CR1_C11  (*((volatile DR8*)PPA_CR1)).bits.bit1
#define PA_CR1_C12  (*((volatile DR8*)PPA_CR1)).bits.bit2
#define PA_CR1_C13  (*((volatile DR8*)PPA_CR1)).bits.bit3
#define PA_CR1_C14  (*((volatile DR8*)PPA_CR1)).bits.bit4
#define PA_CR1_C15  (*((volatile DR8*)PPA_CR1)).bits.bit5
#define PA_CR1_C16  (*((volatile DR8*)PPA_CR1)).bits.bit6
#define PA_CR1_C17  (*((volatile DR8*)PPA_CR1)).bits.bit7

#define PPA_CR2     0x5004
#define PA_CR2      (*((volatile DR8*)PPA_CR2)).byte
#define PA_CR2_C20  (*((volatile DR8*)PPA_CR2)).bits.bit0
#define PA_CR2_C21  (*((volatile DR8*)PPA_CR2)).bits.bit1
#define PA_CR2_C22  (*((volatile DR8*)PPA_CR2)).bits.bit2
#define PA_CR2_C23  (*((volatile DR8*)PPA_CR2)).bits.bit3
#define PA_CR2_C24  (*((volatile DR8*)PPA_CR2)).bits.bit4
#define PA_CR2_C25  (*((volatile DR8*)PPA_CR2)).bits.bit5
#define PA_CR2_C26  (*((volatile DR8*)PPA_CR2)).bits.bit6
#define PA_CR2_C27  (*((volatile DR8*)PPA_CR2)).bits.bit7

#define PPB_ODR     0x5005
#define PB_ODR      (*((volatile DR8*)PPB_ODR)).byte
#define PB_ODR_ODR0 (*((volatile DR8*)PPB_ODR)).bits.bit0
#define PB_ODR_ODR1 (*((volatile DR8*)PPB_ODR)).bits.bit1
#define PB_ODR_ODR2 (*((volatile DR8*)PPB_ODR)).bits.bit2
#define PB_ODR_ODR3 (*((volatile DR8*)PPB_ODR)).bits.bit3
#define PB_ODR_ODR4 (*((volatile DR8*)PPB_ODR)).bits.bit4
#define PB_ODR_ODR5 (*((volatile DR8*)PPB_ODR)).bits.bit5
#define PB_ODR_ODR6 (*((volatile DR8*)PPB_ODR)).bits.bit6
#define PB_ODR_ODR7 (*((volatile DR8*)PPB_ODR)).bits.bit7

#define PPB_IDR     0x5006
#define PB_IDR      (*((volatile DR8*)PPB_IDR)).byte
#define PB_IDR_IDR0 (*((volatile DR8*)PPB_IDR)).bits.bit0
#define PB_IDR_IDR1 (*((volatile DR8*)PPB_IDR)).bits.bit1
#define PB_IDR_IDR2 (*((volatile DR8*)PPB_IDR)).bits.bit2
#define PB_IDR_IDR3 (*((volatile DR8*)PPB_IDR)).bits.bit3
#define PB_IDR_IDR4 (*((volatile DR8*)PPB_IDR)).bits.bit4
#define PB_IDR_IDR5 (*((volatile DR8*)PPB_IDR)).bits.bit5
#define PB_IDR_IDR6 (*((volatile DR8*)PPB_IDR)).bits.bit6
#define PB_IDR_IDR7 (*((volatile DR8*)PPB_IDR)).bits.bit7

#define PPB_DDR     0x5007
#define PB_DDR      (*((volatile DR8*)PPB_DDR)).byte
#define PB_DDR_DDR0 (*((volatile DR8*)PPB_DDR)).bits.bit0
#define PB_DDR_DDR1 (*((volatile DR8*)PPB_DDR)).bits.bit1
#define PB_DDR_DDR2 (*((volatile DR8*)PPB_DDR)).bits.bit2
#define PB_DDR_DDR3 (*((volatile DR8*)PPB_DDR)).bits.bit3
#define PB_DDR_DDR4 (*((volatile DR8*)PPB_DDR)).bits.bit4
#define PB_DDR_DDR5 (*((volatile DR8*)PPB_DDR)).bits.bit5
#define PB_DDR_DDR6 (*((volatile DR8*)PPB_DDR)).bits.bit6
#define PB_DDR_DDR7 (*((volatile DR8*)PPB_DDR)).bits.bit7

