Emile666/THD_Analyzer/stm8s105.h
#define PPB_CR1     0x5008
#define PB_CR1      (*((volatile DR8*)PPB_CR1)).byte
#define PB_CR1_C10  (*((volatile DR8*)PPB_CR1)).bits.bit0
#define PB_CR1_C11  (*((volatile DR8*)PPB_CR1)).bits.bit1
#define PB_CR1_C12  (*((volatile DR8*)PPB_CR1)).bits.bit2
#define PB_CR1_C13  (*((volatile DR8*)PPB_CR1)).bits.bit3
#define PB_CR1_C14  (*((volatile DR8*)PPB_CR1)).bits.bit4
#define PB_CR1_C15  (*((volatile DR8*)PPB_CR1)).bits.bit5
#define PB_CR1_C16  (*((volatile DR8*)PPB_CR1)).bits.bit6
#define PB_CR1_C17  (*((volatile DR8*)PPB_CR1)).bits.bit7

#define PPB_CR2     0x5009
#define PB_CR2      (*((volatile DR8*)PPB_CR2)).byte
#define PB_CR2_C20  (*((volatile DR8*)PPB_CR2)).bits.bit0
#define PB_CR2_C21  (*((volatile DR8*)PPB_CR2)).bits.bit1
#define PB_CR2_C22  (*((volatile DR8*)PPB_CR2)).bits.bit2
#define PB_CR2_C23  (*((volatile DR8*)PPB_CR2)).bits.bit3
#define PB_CR2_C24  (*((volatile DR8*)PPB_CR2)).bits.bit4
#define PB_CR2_C25  (*((volatile DR8*)PPB_CR2)).bits.bit5
#define PB_CR2_C26  (*((volatile DR8*)PPB_CR2)).bits.bit6
#define PB_CR2_C27  (*((volatile DR8*)PPB_CR2)).bits.bit7

#define PPC_ODR     0x500A
#define PC_ODR      (*((volatile DR8*)PPC_ODR)).byte
#define PC_ODR_ODR0 (*((volatile DR8*)PPC_ODR)).bits.bit0
#define PC_ODR_ODR1 (*((volatile DR8*)PPC_ODR)).bits.bit1
#define PC_ODR_ODR2 (*((volatile DR8*)PPC_ODR)).bits.bit2
#define PC_ODR_ODR3 (*((volatile DR8*)PPC_ODR)).bits.bit3
#define PC_ODR_ODR4 (*((volatile DR8*)PPC_ODR)).bits.bit4
#define PC_ODR_ODR5 (*((volatile DR8*)PPC_ODR)).bits.bit5
#define PC_ODR_ODR6 (*((volatile DR8*)PPC_ODR)).bits.bit6
#define PC_ODR_ODR7 (*((volatile DR8*)PPC_ODR)).bits.bit7

#define PPC_IDR     0x500B
#define PC_IDR      (*((volatile DR8*)PPC_IDR)).byte
#define PC_IDR_IDR0 (*((volatile DR8*)PPC_IDR)).bits.bit0
#define PC_IDR_IDR1 (*((volatile DR8*)PPC_IDR)).bits.bit1
#define PC_IDR_IDR2 (*((volatile DR8*)PPC_IDR)).bits.bit2
#define PC_IDR_IDR3 (*((volatile DR8*)PPC_IDR)).bits.bit3
#define PC_IDR_IDR4 (*((volatile DR8*)PPC_IDR)).bits.bit4
#define PC_IDR_IDR5 (*((volatile DR8*)PPC_IDR)).bits.bit5
#define PC_IDR_IDR6 (*((volatile DR8*)PPC_IDR)).bits.bit6
#define PC_IDR_IDR7 (*((volatile DR8*)PPC_IDR)).bits.bit7

#define PPC_DDR     0x500C
#define PC_DDR      (*((volatile DR8*)PPC_DDR)).byte
#define PC_DDR_DDR0 (*((volatile DR8*)PPC_DDR)).bits.bit0
#define PC_DDR_DDR1 (*((volatile DR8*)PPC_DDR)).bits.bit1
#define PC_DDR_DDR2 (*((volatile DR8*)PPC_DDR)).bits.bit2
#define PC_DDR_DDR3 (*((volatile DR8*)PPC_DDR)).bits.bit3
#define PC_DDR_DDR4 (*((volatile DR8*)PPC_DDR)).bits.bit4
#define PC_DDR_DDR5 (*((volatile DR8*)PPC_DDR)).bits.bit5
#define PC_DDR_DDR6 (*((volatile DR8*)PPC_DDR)).bits.bit6
#define PC_DDR_DDR7 (*((volatile DR8*)PPC_DDR)).bits.bit7

#define PPC_CR1     0x500D
#define PC_CR1      (*((volatile DR8*)PPC_CR1)).byte
#define PC_CR1_C10  (*((volatile DR8*)PPC_CR1)).bits.bit0
#define PC_CR1_C11  (*((volatile DR8*)PPC_CR1)).bits.bit1
#define PC_CR1_C12  (*((volatile DR8*)PPC_CR1)).bits.bit2
#define PC_CR1_C13  (*((volatile DR8*)PPC_CR1)).bits.bit3
#define PC_CR1_C14  (*((volatile DR8*)PPC_CR1)).bits.bit4
#define PC_CR1_C15  (*((volatile DR8*)PPC_CR1)).bits.bit5
#define PC_CR1_C16  (*((volatile DR8*)PPC_CR1)).bits.bit6
#define PC_CR1_C17  (*((volatile DR8*)PPC_CR1)).bits.bit7

#define PPC_CR2     0x500E
#define PC_CR2      (*((volatile DR8*)PPC_CR2)).byte
#define PC_CR2_C20  (*((volatile DR8*)PPC_CR2)).bits.bit0
#define PC_CR2_C21  (*((volatile DR8*)PPC_CR2)).bits.bit1
#define PC_CR2_C22  (*((volatile DR8*)PPC_CR2)).bits.bit2
#define PC_CR2_C23  (*((volatile DR8*)PPC_CR2)).bits.bit3
#define PC_CR2_C24  (*((volatile DR8*)PPC_CR2)).bits.bit4
#define PC_CR2_C25  (*((volatile DR8*)PPC_CR2)).bits.bit5
#define PC_CR2_C26  (*((volatile DR8*)PPC_CR2)).bits.bit6
#define PC_CR2_C27  (*((volatile DR8*)PPC_CR2)).bits.bit7

#define PPD_ODR     0x500F
#define PD_ODR      (*((volatile DR8*)PPD_ODR)).byte
#define PD_ODR_ODR0 (*((volatile DR8*)PPD_ODR)).bits.bit0
#define PD_ODR_ODR1 (*((volatile DR8*)PPD_ODR)).bits.bit1
#define PD_ODR_ODR2 (*((volatile DR8*)PPD_ODR)).bits.bit2
#define PD_ODR_ODR3 (*((volatile DR8*)PPD_ODR)).bits.bit3
#define PD_ODR_ODR4 (*((volatile DR8*)PPD_ODR)).bits.bit4
#define PD_ODR_ODR5 (*((volatile DR8*)PPD_ODR)).bits.bit5
#define PD_ODR_ODR6 (*((volatile DR8*)PPD_ODR)).bits.bit6
#define PD_ODR_ODR7 (*((volatile DR8*)PPD_ODR)).bits.bit7

#define PPD_IDR     0x5010
#define PD_IDR      (*((volatile DR8*)PPD_IDR)).byte
#define PD_IDR_IDR0 (*((volatile DR8*)PPD_IDR)).bits.bit0
#define PD_IDR_IDR1 (*((volatile DR8*)PPD_IDR)).bits.bit1
#define PD_IDR_IDR2 (*((volatile DR8*)PPD_IDR)).bits.bit2
#define PD_IDR_IDR3 (*((volatile DR8*)PPD_IDR)).bits.bit3
#define PD_IDR_IDR4 (*((volatile DR8*)PPD_IDR)).bits.bit4
#define PD_IDR_IDR5 (*((volatile DR8*)PPD_IDR)).bits.bit5
#define PD_IDR_IDR6 (*((volatile DR8*)PPD_IDR)).bits.bit6
#define PD_IDR_IDR7 (*((volatile DR8*)PPD_IDR)).bits.bit7

#define PPD_DDR     0x5011
#define PD_DDR      (*((volatile DR8*)PPD_DDR)).byte
#define PD_DDR_DDR0 (*((volatile DR8*)PPD_DDR)).bits.bit0
#define PD_DDR_DDR1 (*((volatile DR8*)PPD_DDR)).bits.bit1
#define PD_DDR_DDR2 (*((volatile DR8*)PPD_DDR)).bits.bit2
#define PD_DDR_DDR3 (*((volatile DR8*)PPD_DDR)).bits.bit3
#define PD_DDR_DDR4 (*((volatile DR8*)PPD_DDR)).bits.bit4
#define PD_DDR_DDR5 (*((volatile DR8*)PPD_DDR)).bits.bit5
#define PD_DDR_DDR6 (*((volatile DR8*)PPD_DDR)).bits.bit6
#define PD_DDR_DDR7 (*((volatile DR8*)PPD_DDR)).bits.bit7

#define PPD_CR1     0x5012
#define PD_CR1      (*((volatile DR8*)PPD_CR1)).byte
#define PD_CR1_C10  (*((volatile DR8*)PPD_CR1)).bits.bit0
#define PD_CR1_C11  (*((volatile DR8*)PPD_CR1)).bits.bit1
#define PD_CR1_C12  (*((volatile DR8*)PPD_CR1)).bits.bit2
#define PD_CR1_C13  (*((volatile DR8*)PPD_CR1)).bits.bit3
#define PD_CR1_C14  (*((volatile DR8*)PPD_CR1)).bits.bit4
#define PD_CR1_C15  (*((volatile DR8*)PPD_CR1)).bits.bit5
#define PD_CR1_C16  (*((volatile DR8*)PPD_CR1)).bits.bit6
#define PD_CR1_C17  (*((volatile DR8*)PPD_CR1)).bits.bit7

#define PPD_CR2     0x5013
#define PD_CR2      (*((volatile DR8*)PPD_CR2)).byte
#define PD_CR2_C20  (*((volatile DR8*)PPD_CR2)).bits.bit0
#define PD_CR2_C21  (*((volatile DR8*)PPD_CR2)).bits.bit1
#define PD_CR2_C22  (*((volatile DR8*)PPD_CR2)).bits.bit2
#define PD_CR2_C23  (*((volatile DR8*)PPD_CR2)).bits.bit3
#define PD_CR2_C24  (*((volatile DR8*)PPD_CR2)).bits.bit4
#define PD_CR2_C25  (*((volatile DR8*)PPD_CR2)).bits.bit5
#define PD_CR2_C26  (*((volatile DR8*)PPD_CR2)).bits.bit6
#define PD_CR2_C27  (*((volatile DR8*)PPD_CR2)).bits.bit7

#define PPE_ODR     0x5014
#define PE_ODR      (*((volatile DR8*)PPE_ODR)).byte
#define PE_ODR_ODR0 (*((volatile DR8*)PPE_ODR)).bits.bit0
#define PE_ODR_ODR1 (*((volatile DR8*)PPE_ODR)).bits.bit1
#define PE_ODR_ODR2 (*((volatile DR8*)PPE_ODR)).bits.bit2
#define PE_ODR_ODR3 (*((volatile DR8*)PPE_ODR)).bits.bit3
#define PE_ODR_ODR4 (*((volatile DR8*)PPE_ODR)).bits.bit4
#define PE_ODR_ODR5 (*((volatile DR8*)PPE_ODR)).bits.bit5
#define PE_ODR_ODR6 (*((volatile DR8*)PPE_ODR)).bits.bit6
#define PE_ODR_ODR7 (*((volatile DR8*)PPE_ODR)).bits.bit7

#define PPE_IDR     0x5015
#define PE_IDR      (*((volatile DR8*)PPE_IDR)).byte
#define PE_IDR_IDR0 (*((volatile DR8*)PPE_IDR)).bits.bit0
#define PE_IDR_IDR1 (*((volatile DR8*)PPE_IDR)).bits.bit1
#define PE_IDR_IDR2 (*((volatile DR8*)PPE_IDR)).bits.bit2
#define PE_IDR_IDR3 (*((volatile DR8*)PPE_IDR)).bits.bit3
#define PE_IDR_IDR4 (*((volatile DR8*)PPE_IDR)).bits.bit4
#define PE_IDR_IDR5 (*((volatile DR8*)PPE_IDR)).bits.bit5
#define PE_IDR_IDR6 (*((volatile DR8*)PPE_IDR)).bits.bit6
#define PE_IDR_IDR7 (*((volatile DR8*)PPE_IDR)).bits.bit7

