Emile666/THD_Analyzer/stm8s105.h
#define PPE_DDR     0x5016
#define PE_DDR      (*((volatile DR8*)PPE_DDR)).byte
#define PE_DDR_DDR0 (*((volatile DR8*)PPE_DDR)).bits.bit0
#define PE_DDR_DDR1 (*((volatile DR8*)PPE_DDR)).bits.bit1
#define PE_DDR_DDR2 (*((volatile DR8*)PPE_DDR)).bits.bit2
#define PE_DDR_DDR3 (*((volatile DR8*)PPE_DDR)).bits.bit3
#define PE_DDR_DDR4 (*((volatile DR8*)PPE_DDR)).bits.bit4
#define PE_DDR_DDR5 (*((volatile DR8*)PPE_DDR)).bits.bit5
#define PE_DDR_DDR6 (*((volatile DR8*)PPE_DDR)).bits.bit6
#define PE_DDR_DDR7 (*((volatile DR8*)PPE_DDR)).bits.bit7

#define PPE_CR1     0x5017
#define PE_CR1      (*((volatile DR8*)PPE_CR1)).byte
#define PE_CR1_C10  (*((volatile DR8*)PPE_CR1)).bits.bit0
#define PE_CR1_C11  (*((volatile DR8*)PPE_CR1)).bits.bit1
#define PE_CR1_C12  (*((volatile DR8*)PPE_CR1)).bits.bit2
#define PE_CR1_C13  (*((volatile DR8*)PPE_CR1)).bits.bit3
#define PE_CR1_C14  (*((volatile DR8*)PPE_CR1)).bits.bit4
#define PE_CR1_C15  (*((volatile DR8*)PPE_CR1)).bits.bit5
#define PE_CR1_C16  (*((volatile DR8*)PPE_CR1)).bits.bit6
#define PE_CR1_C17  (*((volatile DR8*)PPE_CR1)).bits.bit7

#define PPE_CR2     0x5018
#define PE_CR2      (*((volatile DR8*)PPE_CR2)).byte
#define PE_CR2_C20  (*((volatile DR8*)PPE_CR2)).bits.bit0
#define PE_CR2_C21  (*((volatile DR8*)PPE_CR2)).bits.bit1
#define PE_CR2_C22  (*((volatile DR8*)PPE_CR2)).bits.bit2
#define PE_CR2_C23  (*((volatile DR8*)PPE_CR2)).bits.bit3
#define PE_CR2_C24  (*((volatile DR8*)PPE_CR2)).bits.bit4
#define PE_CR2_C25  (*((volatile DR8*)PPE_CR2)).bits.bit5
#define PE_CR2_C26  (*((volatile DR8*)PPE_CR2)).bits.bit6
#define PE_CR2_C27  (*((volatile DR8*)PPE_CR2)).bits.bit7

#define PPF_ODR     0x5019
#define PF_ODR      (*((volatile DR8*)PPF_ODR)).byte
#define PF_ODR_ODR0 (*((volatile DR8*)PPF_ODR)).bits.bit0
#define PF_ODR_ODR1 (*((volatile DR8*)PPF_ODR)).bits.bit1
#define PF_ODR_ODR2 (*((volatile DR8*)PPF_ODR)).bits.bit2
#define PF_ODR_ODR3 (*((volatile DR8*)PPF_ODR)).bits.bit3
#define PF_ODR_ODR4 (*((volatile DR8*)PPF_ODR)).bits.bit4
#define PF_ODR_ODR5 (*((volatile DR8*)PPF_ODR)).bits.bit5
#define PF_ODR_ODR6 (*((volatile DR8*)PPF_ODR)).bits.bit6
#define PF_ODR_ODR7 (*((volatile DR8*)PPF_ODR)).bits.bit7

#define PPF_IDR     0x501A
#define PF_IDR      (*((volatile DR8*)PPF_IDR)).byte
#define PF_IDR_IDR0 (*((volatile DR8*)PPF_IDR)).bits.bit0
#define PF_IDR_IDR1 (*((volatile DR8*)PPF_IDR)).bits.bit1
#define PF_IDR_IDR2 (*((volatile DR8*)PPF_IDR)).bits.bit2
#define PF_IDR_IDR3 (*((volatile DR8*)PPF_IDR)).bits.bit3
#define PF_IDR_IDR4 (*((volatile DR8*)PPF_IDR)).bits.bit4
#define PF_IDR_IDR5 (*((volatile DR8*)PPF_IDR)).bits.bit5
#define PF_IDR_IDR6 (*((volatile DR8*)PPF_IDR)).bits.bit6
#define PF_IDR_IDR7 (*((volatile DR8*)PPF_IDR)).bits.bit7

#define PPF_DDR     0x501B
#define PF_DDR      (*((volatile DR8*)PPF_DDR)).byte
#define PF_DDR_DDR0 (*((volatile DR8*)PPF_DDR)).bits.bit0
#define PF_DDR_DDR1 (*((volatile DR8*)PPF_DDR)).bits.bit1
#define PF_DDR_DDR2 (*((volatile DR8*)PPF_DDR)).bits.bit2
#define PF_DDR_DDR3 (*((volatile DR8*)PPF_DDR)).bits.bit3
#define PF_DDR_DDR4 (*((volatile DR8*)PPF_DDR)).bits.bit4
#define PF_DDR_DDR5 (*((volatile DR8*)PPF_DDR)).bits.bit5
#define PF_DDR_DDR6 (*((volatile DR8*)PPF_DDR)).bits.bit6
#define PF_DDR_DDR7 (*((volatile DR8*)PPF_DDR)).bits.bit7

#define PPF_CR1     0x501C
#define PF_CR1      (*((volatile DR8*)PPF_CR1)).byte
#define PF_CR1_C10  (*((volatile DR8*)PPF_CR1)).bits.bit0
#define PF_CR1_C11  (*((volatile DR8*)PPF_CR1)).bits.bit1
#define PF_CR1_C12  (*((volatile DR8*)PPF_CR1)).bits.bit2
#define PF_CR1_C13  (*((volatile DR8*)PPF_CR1)).bits.bit3
#define PF_CR1_C14  (*((volatile DR8*)PPF_CR1)).bits.bit4
#define PF_CR1_C15  (*((volatile DR8*)PPF_CR1)).bits.bit5
#define PF_CR1_C16  (*((volatile DR8*)PPF_CR1)).bits.bit6
#define PF_CR1_C17  (*((volatile DR8*)PPF_CR1)).bits.bit7

#define PPF_CR2     0x501D
#define PF_CR2      (*((volatile DR8*)PPF_CR2)).byte
#define PF_CR2_C20  (*((volatile DR8*)PPF_CR2)).bits.bit0
#define PF_CR2_C21  (*((volatile DR8*)PPF_CR2)).bits.bit1
#define PF_CR2_C22  (*((volatile DR8*)PPF_CR2)).bits.bit2
#define PF_CR2_C23  (*((volatile DR8*)PPF_CR2)).bits.bit3
#define PF_CR2_C24  (*((volatile DR8*)PPF_CR2)).bits.bit4
#define PF_CR2_C25  (*((volatile DR8*)PPF_CR2)).bits.bit5
#define PF_CR2_C26  (*((volatile DR8*)PPF_CR2)).bits.bit6
#define PF_CR2_C27  (*((volatile DR8*)PPF_CR2)).bits.bit7

#define PPG_ODR     0x501E
#define PG_ODR      (*((volatile DR8*)PPG_ODR)).byte
#define PG_ODR_ODR0 (*((volatile DR8*)PPG_ODR)).bits.bit0
#define PG_ODR_ODR1 (*((volatile DR8*)PPG_ODR)).bits.bit1
#define PG_ODR_ODR2 (*((volatile DR8*)PPG_ODR)).bits.bit2
#define PG_ODR_ODR3 (*((volatile DR8*)PPG_ODR)).bits.bit3
#define PG_ODR_ODR4 (*((volatile DR8*)PPG_ODR)).bits.bit4
#define PG_ODR_ODR5 (*((volatile DR8*)PPG_ODR)).bits.bit5
#define PG_ODR_ODR6 (*((volatile DR8*)PPG_ODR)).bits.bit6
#define PG_ODR_ODR7 (*((volatile DR8*)PPG_ODR)).bits.bit7

#define PPG_IDR     0x501F
#define PG_IDR      (*((volatile DR8*)PPG_IDR)).byte
#define PG_IDR_IDR0 (*((volatile DR8*)PPG_IDR)).bits.bit0
#define PG_IDR_IDR1 (*((volatile DR8*)PPG_IDR)).bits.bit1
#define PG_IDR_IDR2 (*((volatile DR8*)PPG_IDR)).bits.bit2
#define PG_IDR_IDR3 (*((volatile DR8*)PPG_IDR)).bits.bit3
#define PG_IDR_IDR4 (*((volatile DR8*)PPG_IDR)).bits.bit4
#define PG_IDR_IDR5 (*((volatile DR8*)PPG_IDR)).bits.bit5
#define PG_IDR_IDR6 (*((volatile DR8*)PPG_IDR)).bits.bit6
#define PG_IDR_IDR7 (*((volatile DR8*)PPG_IDR)).bits.bit7

#define PPG_DDR     0x5020
#define PG_DDR      (*((volatile DR8*)PPG_DDR)).byte
#define PG_DDR_DDR0 (*((volatile DR8*)PPG_DDR)).bits.bit0
#define PG_DDR_DDR1 (*((volatile DR8*)PPG_DDR)).bits.bit1
#define PG_DDR_DDR2 (*((volatile DR8*)PPG_DDR)).bits.bit2
#define PG_DDR_DDR3 (*((volatile DR8*)PPG_DDR)).bits.bit3
#define PG_DDR_DDR4 (*((volatile DR8*)PPG_DDR)).bits.bit4
#define PG_DDR_DDR5 (*((volatile DR8*)PPG_DDR)).bits.bit5
#define PG_DDR_DDR6 (*((volatile DR8*)PPG_DDR)).bits.bit6
#define PG_DDR_DDR7 (*((volatile DR8*)PPG_DDR)).bits.bit7

#define PPG_CR1     0x5021
#define PG_CR1      (*((volatile DR8*)PPG_CR1)).byte
#define PG_CR1_C10  (*((volatile DR8*)PPG_CR1)).bits.bit0
#define PG_CR1_C11  (*((volatile DR8*)PPG_CR1)).bits.bit1
#define PG_CR1_C12  (*((volatile DR8*)PPG_CR1)).bits.bit2
#define PG_CR1_C13  (*((volatile DR8*)PPG_CR1)).bits.bit3
#define PG_CR1_C14  (*((volatile DR8*)PPG_CR1)).bits.bit4
#define PG_CR1_C15  (*((volatile DR8*)PPG_CR1)).bits.bit5
#define PG_CR1_C16  (*((volatile DR8*)PPG_CR1)).bits.bit6
#define PG_CR1_C17  (*((volatile DR8*)PPG_CR1)).bits.bit7

#define PPG_CR2     0x5022
#define PG_CR2      (*((volatile DR8*)PPG_CR2)).byte
#define PG_CR2_C20  (*((volatile DR8*)PPG_CR2)).bits.bit0
#define PG_CR2_C21  (*((volatile DR8*)PPG_CR2)).bits.bit1
#define PG_CR2_C22  (*((volatile DR8*)PPG_CR2)).bits.bit2
#define PG_CR2_C23  (*((volatile DR8*)PPG_CR2)).bits.bit3
#define PG_CR2_C24  (*((volatile DR8*)PPG_CR2)).bits.bit4
#define PG_CR2_C25  (*((volatile DR8*)PPG_CR2)).bits.bit5
#define PG_CR2_C26  (*((volatile DR8*)PPG_CR2)).bits.bit6
#define PG_CR2_C27  (*((volatile DR8*)PPG_CR2)).bits.bit7

