Emile666/THD_Analyzer/stm8s105.h
#define PPH_ODR     0x5023
#define PH_ODR      (*((volatile DR8*)PPH_ODR)).byte
#define PH_ODR_ODR0 (*((volatile DR8*)PPH_ODR)).bits.bit0
#define PH_ODR_ODR1 (*((volatile DR8*)PPH_ODR)).bits.bit1
#define PH_ODR_ODR2 (*((volatile DR8*)PPH_ODR)).bits.bit2
#define PH_ODR_ODR3 (*((volatile DR8*)PPH_ODR)).bits.bit3
#define PH_ODR_ODR4 (*((volatile DR8*)PPH_ODR)).bits.bit4
#define PH_ODR_ODR5 (*((volatile DR8*)PPH_ODR)).bits.bit5
#define PH_ODR_ODR6 (*((volatile DR8*)PPH_ODR)).bits.bit6
#define PH_ODR_ODR7 (*((volatile DR8*)PPH_ODR)).bits.bit7

#define PPH_IDR     0x5024
#define PH_IDR      (*((volatile DR8*)PPH_IDR)).byte
#define PH_IDR_IDR0 (*((volatile DR8*)PPH_IDR)).bits.bit0
#define PH_IDR_IDR1 (*((volatile DR8*)PPH_IDR)).bits.bit1
#define PH_IDR_IDR2 (*((volatile DR8*)PPH_IDR)).bits.bit2
#define PH_IDR_IDR3 (*((volatile DR8*)PPH_IDR)).bits.bit3
#define PH_IDR_IDR4 (*((volatile DR8*)PPH_IDR)).bits.bit4
#define PH_IDR_IDR5 (*((volatile DR8*)PPH_IDR)).bits.bit5
#define PH_IDR_IDR6 (*((volatile DR8*)PPH_IDR)).bits.bit6
#define PH_IDR_IDR7 (*((volatile DR8*)PPH_IDR)).bits.bit7

#define PPH_DDR     0x5025
#define PH_DDR      (*((volatile DR8*)PPH_DDR)).byte
#define PH_DDR_DDR0 (*((volatile DR8*)PPH_DDR)).bits.bit0
#define PH_DDR_DDR1 (*((volatile DR8*)PPH_DDR)).bits.bit1
#define PH_DDR_DDR2 (*((volatile DR8*)PPH_DDR)).bits.bit2
#define PH_DDR_DDR3 (*((volatile DR8*)PPH_DDR)).bits.bit3
#define PH_DDR_DDR4 (*((volatile DR8*)PPH_DDR)).bits.bit4
#define PH_DDR_DDR5 (*((volatile DR8*)PPH_DDR)).bits.bit5
#define PH_DDR_DDR6 (*((volatile DR8*)PPH_DDR)).bits.bit6
#define PH_DDR_DDR7 (*((volatile DR8*)PPH_DDR)).bits.bit7

#define PPH_CR1     0x5026
#define PH_CR1      (*((volatile DR8*)PPH_CR1)).byte
#define PH_CR1_C10  (*((volatile DR8*)PPH_CR1)).bits.bit0
#define PH_CR1_C11  (*((volatile DR8*)PPH_CR1)).bits.bit1
#define PH_CR1_C12  (*((volatile DR8*)PPH_CR1)).bits.bit2
#define PH_CR1_C13  (*((volatile DR8*)PPH_CR1)).bits.bit3
#define PH_CR1_C14  (*((volatile DR8*)PPH_CR1)).bits.bit4
#define PH_CR1_C15  (*((volatile DR8*)PPH_CR1)).bits.bit5
#define PH_CR1_C16  (*((volatile DR8*)PPH_CR1)).bits.bit6
#define PH_CR1_C17  (*((volatile DR8*)PPH_CR1)).bits.bit7

#define PPH_CR2     0x5027
#define PH_CR2      (*((volatile DR8*)PPH_CR2)).byte
#define PH_CR2_C20  (*((volatile DR8*)PPH_CR2)).bits.bit0
#define PH_CR2_C21  (*((volatile DR8*)PPH_CR2)).bits.bit1
#define PH_CR2_C22  (*((volatile DR8*)PPH_CR2)).bits.bit2
#define PH_CR2_C23  (*((volatile DR8*)PPH_CR2)).bits.bit3
#define PH_CR2_C24  (*((volatile DR8*)PPH_CR2)).bits.bit4
#define PH_CR2_C25  (*((volatile DR8*)PPH_CR2)).bits.bit5
#define PH_CR2_C26  (*((volatile DR8*)PPH_CR2)).bits.bit6
#define PH_CR2_C27  (*((volatile DR8*)PPH_CR2)).bits.bit7

#define PPI_ODR     0x5028
#define PI_ODR      (*((volatile DR8*)PPI_ODR)).byte
#define PI_ODR_ODR0 (*((volatile DR8*)PPI_ODR)).bits.bit0
#define PI_ODR_ODR1 (*((volatile DR8*)PPI_ODR)).bits.bit1
#define PI_ODR_ODR2 (*((volatile DR8*)PPI_ODR)).bits.bit2
#define PI_ODR_ODR3 (*((volatile DR8*)PPI_ODR)).bits.bit3
#define PI_ODR_ODR4 (*((volatile DR8*)PPI_ODR)).bits.bit4
#define PI_ODR_ODR5 (*((volatile DR8*)PPI_ODR)).bits.bit5
#define PI_ODR_ODR6 (*((volatile DR8*)PPI_ODR)).bits.bit6
#define PI_ODR_ODR7 (*((volatile DR8*)PPI_ODR)).bits.bit7

#define PPI_IDR     0x5029
#define PI_IDR      (*((volatile DR8*)PPI_IDR)).byte
#define PI_IDR_IDR0 (*((volatile DR8*)PPI_IDR)).bits.bit0
#define PI_IDR_IDR1 (*((volatile DR8*)PPI_IDR)).bits.bit1
#define PI_IDR_IDR2 (*((volatile DR8*)PPI_IDR)).bits.bit2
#define PI_IDR_IDR3 (*((volatile DR8*)PPI_IDR)).bits.bit3
#define PI_IDR_IDR4 (*((volatile DR8*)PPI_IDR)).bits.bit4
#define PI_IDR_IDR5 (*((volatile DR8*)PPI_IDR)).bits.bit5
#define PI_IDR_IDR6 (*((volatile DR8*)PPI_IDR)).bits.bit6
#define PI_IDR_IDR7 (*((volatile DR8*)PPI_IDR)).bits.bit7

#define PPI_DDR     0x502A
#define PI_DDR      (*((volatile DR8*)PPI_DDR)).byte
#define PI_DDR_DDR0 (*((volatile DR8*)PPI_DDR)).bits.bit0
#define PI_DDR_DDR1 (*((volatile DR8*)PPI_DDR)).bits.bit1
#define PI_DDR_DDR2 (*((volatile DR8*)PPI_DDR)).bits.bit2
#define PI_DDR_DDR3 (*((volatile DR8*)PPI_DDR)).bits.bit3
#define PI_DDR_DDR4 (*((volatile DR8*)PPI_DDR)).bits.bit4
#define PI_DDR_DDR5 (*((volatile DR8*)PPI_DDR)).bits.bit5
#define PI_DDR_DDR6 (*((volatile DR8*)PPI_DDR)).bits.bit6
#define PI_DDR_DDR7 (*((volatile DR8*)PPI_DDR)).bits.bit7

#define PPI_CR1     0x502B
#define PI_CR1      (*((volatile DR8*)PPI_CR1)).byte
#define PI_CR1_C10  (*((volatile DR8*)PPI_CR1)).bits.bit0
#define PI_CR1_C11  (*((volatile DR8*)PPI_CR1)).bits.bit1
#define PI_CR1_C12  (*((volatile DR8*)PPI_CR1)).bits.bit2
#define PI_CR1_C13  (*((volatile DR8*)PPI_CR1)).bits.bit3
#define PI_CR1_C14  (*((volatile DR8*)PPI_CR1)).bits.bit4
#define PI_CR1_C15  (*((volatile DR8*)PPI_CR1)).bits.bit5
#define PI_CR1_C16  (*((volatile DR8*)PPI_CR1)).bits.bit6
#define PI_CR1_C17  (*((volatile DR8*)PPI_CR1)).bits.bit7

#define PPI_CR2     0x502C
#define PI_CR2      (*((volatile DR8*)PPI_CR2)).byte
#define PI_CR2_C20  (*((volatile DR8*)PPI_CR2)).bits.bit0
#define PI_CR2_C21  (*((volatile DR8*)PPI_CR2)).bits.bit1
#define PI_CR2_C22  (*((volatile DR8*)PPI_CR2)).bits.bit2
#define PI_CR2_C23  (*((volatile DR8*)PPI_CR2)).bits.bit3
#define PI_CR2_C24  (*((volatile DR8*)PPI_CR2)).bits.bit4
#define PI_CR2_C25  (*((volatile DR8*)PPI_CR2)).bits.bit5
#define PI_CR2_C26  (*((volatile DR8*)PPI_CR2)).bits.bit6
#define PI_CR2_C27  (*((volatile DR8*)PPI_CR2)).bits.bit7

//--------------------------------------------------
// Flash program memory and data EEPROM
//--------------------------------------------------
#define PFLASH_CR1      0x505A
#define FLASH_CR1       (*((volatile DR8*)PFLASH_CR1)).byte
#define FLASH_CR1_FIX   (*((volatile DR8*)PFLASH_CR1)).bits.bit0
#define FLASH_CR1_IE    (*((volatile DR8*)PFLASH_CR1)).bits.bit1
#define FLASH_CR1_AHALT (*((volatile DR8*)PFLASH_CR1)).bits.bit2
#define FLASH_CR1_HALT  (*((volatile DR8*)PFLASH_CR1)).bits.bit3

#define PFLASH_CR2      0x505B
#define FLASH_CR2       (*((volatile DR8*)PFLASH_CR2)).byte
#define FLASH_CR2_PRG   (*((volatile DR8*)PFLASH_CR2)).bits.bit0
#define FLASH_CR2_FPRG  (*((volatile DR8*)PFLASH_CR2)).bits.bit4
#define FLASH_CR2_ERASE (*((volatile DR8*)PFLASH_CR2)).bits.bit5
#define FLASH_CR2_WPRG  (*((volatile DR8*)PFLASH_CR2)).bits.bit6
#define FLASH_CR2_OPT   (*((volatile DR8*)PFLASH_CR2)).bits.bit7

#define PFLASH_NCR2      0x505C
#define FLASH_NCR2        (*((volatile DR8*)PFLASH_NCR2)).byte
#define FLASH_NCR2_NPRG   (*((volatile DR8*)PFLASH_NCR2)).bits.bit0
#define FLASH_NCR2_NFPRG  (*((volatile DR8*)PFLASH_NCR2)).bits.bit4
#define FLASH_NCR2_NERASE (*((volatile DR8*)PFLASH_NCR2)).bits.bit5
#define FLASH_NCR2_NWPRG  (*((volatile DR8*)PFLASH_NCR2)).bits.bit6
#define FLASH_NCR2_NOPT   (*((volatile DR8*)PFLASH_NCR2)).bits.bit7

