Emile666/THD_Analyzer/stm8s105.h
#define PFLASH_FPR      0x505D
#define FLASH_FPR       (*((volatile DR8*)PFLASH_FPR)).byte
#define FLASH_FPR_WPB0  (*((volatile DR8*)PFLASH_FPR)).bits.bit0
#define FLASH_FPR_WPB1  (*((volatile DR8*)PFLASH_FPR)).bits.bit1
#define FLASH_FPR_WPB2  (*((volatile DR8*)PFLASH_FPR)).bits.bit2
#define FLASH_FPR_WPB3  (*((volatile DR8*)PFLASH_FPR)).bits.bit3
#define FLASH_FPR_WPB4  (*((volatile DR8*)PFLASH_FPR)).bits.bit4
#define FLASH_FPR_WPB5  (*((volatile DR8*)PFLASH_FPR)).bits.bit5

#define PFLASH_NFPR      0x505E
#define FLASH_NFPR       (*((volatile DR8*)PFLASH_NFPR)).byte
#define FLASH_NFPR_WPB0  (*((volatile DR8*)PFLASH_NFPR)).bits.bit0
#define FLASH_NFPR_WPB1  (*((volatile DR8*)PFLASH_NFPR)).bits.bit1
#define FLASH_NFPR_WPB2  (*((volatile DR8*)PFLASH_NFPR)).bits.bit2
#define FLASH_NFPR_WPB3  (*((volatile DR8*)PFLASH_NFPR)).bits.bit3
#define FLASH_NFPR_WPB4  (*((volatile DR8*)PFLASH_NFPR)).bits.bit4
#define FLASH_NFPR_WPB5  (*((volatile DR8*)PFLASH_NFPR)).bits.bit5

#define PFLASH_IAPSR          0x505F
#define FLASH_IAPSR           (*((volatile DR8*)PFLASH_IAPSR)).byte
#define FLASH_IAPSR_WR_PG_DIS (*((volatile DR8*)PFLASH_IAPSR)).bits.bit0
#define FLASH_IAPSR_PUL       (*((volatile DR8*)PFLASH_IAPSR)).bits.bit1
#define FLASH_IAPSR_EOP       (*((volatile DR8*)PFLASH_IAPSR)).bits.bit2
#define FLASH_IAPSR_DUL       (*((volatile DR8*)PFLASH_IAPSR)).bits.bit3
#define FLASH_IAPSR_HVOFF     (*((volatile DR8*)PFLASH_IAPSR)).bits.bit6

#define PFLASH_PUKR           0x5062
#define FLASH_PUKR            (*((volatile DR8*)PFLASH_PUKR)).byte

#define PFLASH_DUKR           0x5064
#define FLASH_DUKR            (*((volatile DR8*)PFLASH_DUKR)).byte

//-----------------------------------------------------------
// ITC (interrupt controller) - EXTI register definitions
//-----------------------------------------------------------
#define PEXTI_CR1             0x50A0
#define EXTI_CR1              (*((volatile DR2222*)PEXTI_CR1)).byte
#define EXTI_CR1_PAIS         (*((volatile DR2222*)PEXTI_CR1)).bits.bit01
#define EXTI_CR1_PBIS         (*((volatile DR2222*)PEXTI_CR1)).bits.bit23
#define EXTI_CR1_PCIS         (*((volatile DR2222*)PEXTI_CR1)).bits.bit45
#define EXTI_CR1_PDIS         (*((volatile DR2222*)PEXTI_CR1)).bits.bit67

#define PEXTI_CR2             0x50A1
#define EXTI_CR2              (*((volatile DR21*)PEXTI_CR2)).byte
#define EXTI_CR2_PEIS         (*((volatile DR21*)PEXTI_CR2)).bits.bit01
#define EXTI_CR2_TLIS         (*((volatile DR21*)PEXTI_CR2)).bits.bit2

//--------------------------------------------------
// RST (reset) register definitions
//--------------------------------------------------
#define PRST_SR               0x50B3
#define RST_SR                (*((volatile DR8*)PRST_SR)).byte
#define RST_SR_WWDGF          (*((volatile DR8*)PRST_SR)).bits.bit0
#define RST_SR_IWDGF          (*((volatile DR8*)PRST_SR)).bits.bit1
#define RST_SR_ILLOPF         (*((volatile DR8*)PRST_SR)).bits.bit2
#define RST_SR_SWIMF          (*((volatile DR8*)PRST_SR)).bits.bit3
#define RST_SR_EMCF           (*((volatile DR8*)PRST_SR)).bits.bit4

//--------------------------------------------------
// CLK (clock control) register definitions
//--------------------------------------------------
#define PCLK_ICKR             0x50C0
#define CLK_ICKR              (*((volatile DR8*)PCLK_ICKR)).byte
#define CLK_ICKR_HSIEN        (*((volatile DR8*)PCLK_ICKR)).bits.bit0
#define CLK_ICKR_HSIRDY       (*((volatile DR8*)PCLK_ICKR)).bits.bit1
#define CLK_ICKR_FHW          (*((volatile DR8*)PCLK_ICKR)).bits.bit2
#define CLK_ICKR_LSIEN        (*((volatile DR8*)PCLK_ICKR)).bits.bit3
#define CLK_ICKR_LSIRDY       (*((volatile DR8*)PCLK_ICKR)).bits.bit4
#define CLK_ICKR_REGAH        (*((volatile DR8*)PCLK_ICKR)).bits.bit5

#define PCLK_ECKR             0x50C1
#define CLK_ECKR              (*((volatile DR8*)PCLK_ECKR)).byte
#define CLK_ECKR_HSEEN        (*((volatile DR8*)PCLK_ECKR)).bits.bit0
#define CLK_ECKR_HSERDY       (*((volatile DR8*)PCLK_ECKR)).bits.bit1

#define PCLK_CMSR             0x50C3
#define CLK_CMSR              (*((volatile DR8*)PCLK_CMSR)).byte

#define PCLK_SWR              0x50C4
#define CLK_SWR               (*((volatile DR8*)PCLK_SWR)).byte

#define PCLK_SWCR             0x50C5
#define CLK_SWCR              (*((volatile DR8*)PCLK_SWCR)).byte
#define CLK_SWCR_SWBSY        (*((volatile DR8*)PCLK_SWCR)).bits.bit0
#define CLK_SWCR_SWEN         (*((volatile DR8*)PCLK_SWCR)).bits.bit1
#define CLK_SWCR_SWIEN        (*((volatile DR8*)PCLK_SWCR)).bits.bit2
#define CLK_SWCR_SWIF         (*((volatile DR8*)PCLK_SWCR)).bits.bit3

#define PCLK_CKDIVR           0x50C6
#define CLK_CKDIVR            (*((volatile DR321*)PCLK_CKDIVR)).byte
#define CLK_CKDIVR_CPUDIV     (*((volatile DR321*)PCLK_CKDIVR)).bits.bit02
#define CLK_CKDIVR_HSIDIV     (*((volatile DR321*)PCLK_CKDIVR)).bits.bit34

#define PCLK_PCKENR1          0x50C7
#define CLK_PCKENR1           (*((volatile DR8*)PCLK_PCKENR1)).byte

#define PCLK_CSSR             0x50C8
#define CLK_CSSR              (*((volatile DR8*)PCLK_CSSR)).byte
#define CLK_CSSR_CSSEN        (*((volatile DR8*)PCLK_CSSR)).bits.bit0
#define CLK_CSSR_AUX          (*((volatile DR8*)PCLK_CSSR)).bits.bit1
#define CLK_CSSR_CSSDIE       (*((volatile DR8*)PCLK_CSSR)).bits.bit2
#define CLK_CSSR_CSSD         (*((volatile DR8*)PCLK_CSSR)).bits.bit3

#define PCLK_CCOR             0x50C9
#define CLK_CCOR              (*((volatile DR14*)PCLK_CCOR)).byte
#define CLK_CCOR_CCOEN        (*((volatile DR14*)PCLK_CCOR)).bits.bit0
#define CLK_CCOR_CCOSEL       (*((volatile DR14*)PCLK_CCOR)).bits.bit14
#define CLK_CCOR_CCORDY       (*((volatile DR14*)PCLK_CCOR)).bits.bit5
#define CLK_CCOR_CCOBSY       (*((volatile DR14*)PCLK_CCOR)).bits.bit6

#define PCLK_PCKENR2          0x50CA
#define CLK_PCKENR2           (*((volatile DR8*)PCLK_PCKENR2)).byte

#define PCLK_HSITRIMR         0x50CC
#define CLK_HSITRIMR          (*((volatile DR41*)PCLK_HSITRIMR)).byte
#define CLK_HSITRIMR_HSITRIM  (*((volatile DR41*)PCLK_HSITRIMR)).bits.bit03

#define PCLK_SWIMCCR          0x50CD
#define CLK_SWIMCCR           (*((volatile DR8*)PCLK_SWIMCCR)).byte
#define CLK_SWIMCCR_SWIMCLK   (*((volatile DR8*)PCLK_SWIMCCR)).bits.bit0

//--------------------------------------------------
// WWDG (window watchdog) register definitions
//--------------------------------------------------
#define PWWDG_CR             0x50D1
#define WWDG_CR              (*((volatile DR8*)PWWDG_CR)).byte
#define WWDG_CR_T0           (*((volatile DR8*)PWWDG_CR)).bits.bit0
#define WWDG_CR_T1           (*((volatile DR8*)PWWDG_CR)).bits.bit1
#define WWDG_CR_T2           (*((volatile DR8*)PWWDG_CR)).bits.bit2
#define WWDG_CR_T3           (*((volatile DR8*)PWWDG_CR)).bits.bit3
#define WWDG_CR_T4           (*((volatile DR8*)PWWDG_CR)).bits.bit4
#define WWDG_CR_T5           (*((volatile DR8*)PWWDG_CR)).bits.bit5
#define WWDG_CR_T6           (*((volatile DR8*)PWWDG_CR)).bits.bit6
#define WWDG_CR_WDGA         (*((volatile DR8*)PWWDG_CR)).bits.bit7

#define PWWDG_WR             0x50D2
#define WWDG_WR              (*((volatile DR8*)PWWDG_WR)).byte
#define WWDG_WR_W0           (*((volatile DR8*)PWWDG_WR)).bits.bit0
#define WWDG_WR_W1           (*((volatile DR8*)PWWDG_WR)).bits.bit1
#define WWDG_WR_W2           (*((volatile DR8*)PWWDG_WR)).bits.bit2
#define WWDG_WR_W3           (*((volatile DR8*)PWWDG_WR)).bits.bit3
#define WWDG_WR_W4           (*((volatile DR8*)PWWDG_WR)).bits.bit4
#define WWDG_WR_W5           (*((volatile DR8*)PWWDG_WR)).bits.bit5
#define WWDG_WR_W6           (*((volatile DR8*)PWWDG_WR)).bits.bit6

//--------------------------------------------------
// IWDG (independent watchdog) register definitions
//--------------------------------------------------
#define PIWDG_KR             0x50E0
#define IWDG_KR              (*((volatile DR8*)PIWDG_KR)).byte

#define PIWDG_PR             0x50E1
#define IWDG_PR              (*((volatile DR3131*)PIWDG_PR)).byte
#define IWDG_PR_PR           (*((volatile DR3131*)PIWDG_PR)).bits.bit02

#define PIWDG_RLR            0x50E2
#define IWDG_RLR             (*((volatile DR8*)PIWDG_RLR)).byte

//--------------------------------------------------
// AWU (auto-wakeup) register definitions
//--------------------------------------------------
#define PAWU_CSR             0x50F0
#define AWU_CSR              (*((volatile DR8*)PAWU_CSR)).byte
#define AWU_CSR_MSR          (*((volatile DR8*)PAWU_CSR)).bits.bit0
#define AWU_CSR_AWUEN        (*((volatile DR8*)PAWU_CSR)).bits.bit4
#define AWU_CSR_AWUF         (*((volatile DR8*)PAWU_CSR)).bits.bit5

#define PAWU_APR             0x50F1
#define AWU_APR              (*((volatile DR61*)PAWU_APR)).byte
#define AWU_APR_APR          (*((volatile DR61*)PAWU_APR)).bits.bit05

#define PAWU_TBR             0x50F2
#define AWU_TBR              (*((volatile DR41*)PAWU_TBR)).byte
#define AWU_TBR_AWUTB        (*((volatile DR41*)PAWU_TBR)).bits.bit03

//--------------------------------------------------
// BEEP (beeper) register definitions
//--------------------------------------------------
#define PBEEP_CSR            0x50F3
#define BEEP_CSR             (*((volatile DR512*)PBEEP_CSR)).byte
#define BEEP_CSR_BEEPDIV     (*((volatile DR512*)PBEEP_CSR)).bits.bit04
#define BEEP_CSR_BEEPEN      (*((volatile DR512*)PBEEP_CSR)).bits.bit5
#define BEEP_CSR_BEEPSEL     (*((volatile DR512*)PBEEP_CSR)).bits.bit67

