Emile666/THD_Analyzer/stm8s105.h
//-----------------------------------------------------------
// SPI (Serial Peripheral Interface) register definitions
//-----------------------------------------------------------
#define PSPI_CR1             0x5200
#define SPI_CR1              (*((volatile DR11131*)PSPI_CR1)).byte
#define SPI_CR1_CPHA         (*((volatile DR11131*)PSPI_CR1)).bits.bit0
#define SPI_CR1_CPOL         (*((volatile DR11131*)PSPI_CR1)).bits.bit1
#define SPI_CR1_MSTR         (*((volatile DR11131*)PSPI_CR1)).bits.bit2
#define SPI_CR1_BR           (*((volatile DR11131*)PSPI_CR1)).bits.bit35
#define SPI_CR1_SPE          (*((volatile DR11131*)PSPI_CR1)).bits.bit6
#define SPI_CR1_LSBFIRST     (*((volatile DR11131*)PSPI_CR1)).bits.bit7

#define PSPI_CR2             0x5201
#define SPI_CR2              (*((volatile DR8*)PSPI_CR2)).byte
#define SPI_CR2_SSI          (*((volatile DR8*)PSPI_CR2)).bits.bit0
#define SPI_CR2_SSM          (*((volatile DR8*)PSPI_CR2)).bits.bit1
#define SPI_CR2_RXONLY       (*((volatile DR8*)PSPI_CR2)).bits.bit2
#define SPI_CR2_CRCNEXT      (*((volatile DR8*)PSPI_CR2)).bits.bit4
#define SPI_CR2_CECEN        (*((volatile DR8*)PSPI_CR2)).bits.bit5
#define SPI_CR2_BDOE         (*((volatile DR8*)PSPI_CR2)).bits.bit6
#define SPI_CR2_BDM          (*((volatile DR8*)PSPI_CR2)).bits.bit7

#define PSPI_ICR             0x5202
#define SPI_ICR              (*((volatile DR8*)PSPI_ICR)).byte
#define SPI_ICR_WKIE         (*((volatile DR8*)PSPI_ICR)).bits.bit4
#define SPI_ICR_ERRIE        (*((volatile DR8*)PSPI_ICR)).bits.bit5
#define SPI_ICR_RXIE         (*((volatile DR8*)PSPI_ICR)).bits.bit6
#define SPI_ICR_TXIE         (*((volatile DR8*)PSPI_ICR)).bits.bit7

#define PSPI_SR             0x5203
#define SPI_SR              (*((volatile DR8*)PSPI_SR)).byte
#define SPI_SR_RXNE         (*((volatile DR8*)PSPI_SR)).bits.bit0
#define SPI_SR_TXE          (*((volatile DR8*)PSPI_SR)).bits.bit1
#define SPI_SR_WKUP         (*((volatile DR8*)PSPI_SR)).bits.bit3
#define SPI_SR_CRCERR       (*((volatile DR8*)PSPI_SR)).bits.bit4
#define SPI_SR_MODF         (*((volatile DR8*)PSPI_SR)).bits.bit5
#define SPI_SR_OVR          (*((volatile DR8*)PSPI_SR)).bits.bit6
#define SPI_SR_BSY          (*((volatile DR8*)PSPI_SR)).bits.bit7

#define PSPI_DR             0x5204
#define SPI_DR              (*((volatile DR8*)PSPI_DR)).byte

#define PSPI_CRCPR          0x5205
#define SPI_CRCPR           (*((volatile DR8*)PSPI_CRCPR)).byte

#define PSPI_RXCRCR         0x5206
#define SPI_RXCRCR          (*((volatile DR8*)PSPI_RXCRCR)).byte

#define PSPI_TXCRCR         0x5207
#define SPI_TXCRCR          (*((volatile DR8*)PSPI_TXCRCR)).byte

//-----------------------------------------------------------
// I2C (Inter-integrated Interface) register definitions
//-----------------------------------------------------------
#define PI2C_CR1             0x5210
#define I2C_CR1              (*((volatile DR8*)PI2C_CR1)).byte
#define I2C_CR1_PE           (*((volatile DR8*)PI2C_CR1)).bits.bit0
#define I2C_CR1_ENGC         (*((volatile DR8*)PI2C_CR1)).bits.bit6
#define I2C_CR1_NOSTRETCH    (*((volatile DR8*)PI2C_CR1)).bits.bit7

#define PI2C_CR2             0x5211
#define I2C_CR2              (*((volatile DR8*)PI2C_CR2)).byte
#define I2C_CR2_START        (*((volatile DR8*)PI2C_CR2)).bits.bit0
#define I2C_CR2_STOP         (*((volatile DR8*)PI2C_CR2)).bits.bit1
#define I2C_CR2_ACK          (*((volatile DR8*)PI2C_CR2)).bits.bit2
#define I2C_CR2_POS          (*((volatile DR8*)PI2C_CR2)).bits.bit3
#define I2C_CR2_SWRST        (*((volatile DR8*)PI2C_CR2)).bits.bit7

#define PI2C_FREQR           0x5212
#define I2C_FREQR            (*((volatile DR8*)PI2C_FREQR)).byte
#define I2C_FREQR_FREQ       (*((volatile DR8*)PI2C_FREQR)).bits.bit05

#define PI2C_OARL           0x5213
#define I2C_OARL            (*((volatile DR17*)PI2C_OARL)).byte
#define I2C_OARL_ADD0       (*((volatile DR17*)PI2C_OARL)).bits.bit0
#define I2C_OARL_ADD        (*((volatile DR17*)PI2C_OARL)).bits.bit17

#define PI2C_OARH           0x5214
#define I2C_OARH            (*((volatile DR12*)PI2C_OARH)).byte
#define I2C_OARH_ADD        (*((volatile DR12*)PI2C_OARH)).bits.bit12
#define I2C_OARH_ADDCONF    (*((volatile DR12*)PI2C_OARH)).bits.bit6
#define I2C_OARH_ADDMODE    (*((volatile DR12*)PI2C_OARH)).bits.bit7

#define PI2C_DR             0x5216
#define I2C_DR              (*((volatile DR8*)PI2C_DR)).byte

#define PI2C_SR1            0x5217
#define I2C_SR1             (*((volatile DR8*)PI2C_SR1)).byte
#define I2C_SR1_SB          (*((volatile DR8*)PI2C_SR1)).bits.bit0
#define I2C_SR1_ADDR        (*((volatile DR8*)PI2C_SR1)).bits.bit1
#define I2C_SR1_BTF         (*((volatile DR8*)PI2C_SR1)).bits.bit2
#define I2C_SR1_ADD10       (*((volatile DR8*)PI2C_SR1)).bits.bit3
#define I2C_SR1_STOPF       (*((volatile DR8*)PI2C_SR1)).bits.bit4
#define I2C_SR1_RXNE        (*((volatile DR8*)PI2C_SR1)).bits.bit6
#define I2C_SR1_TXE         (*((volatile DR8*)PI2C_SR1)).bits.bit7

#define PI2C_SR2            0x5218
#define I2C_SR2             (*((volatile DR8*)PI2C_SR2)).byte
#define I2C_SR2_BERR        (*((volatile DR8*)PI2C_SR2)).bits.bit0
#define I2C_SR2_ARLO        (*((volatile DR8*)PI2C_SR2)).bits.bit1
#define I2C_SR2_AF          (*((volatile DR8*)PI2C_SR2)).bits.bit2
#define I2C_SR2_OVR         (*((volatile DR8*)PI2C_SR2)).bits.bit3
#define I2C_SR2_WUFH        (*((volatile DR8*)PI2C_SR2)).bits.bit5

#define PI2C_SR3            0x5219
#define I2C_SR3             (*((volatile DR8*)PI2C_SR3)).byte
#define I2C_SR3_MSL         (*((volatile DR8*)PI2C_SR3)).bits.bit0
#define I2C_SR3_BUSY        (*((volatile DR8*)PI2C_SR3)).bits.bit1
#define I2C_SR3_TRA         (*((volatile DR8*)PI2C_SR3)).bits.bit2
#define I2C_SR3_GENCALL     (*((volatile DR8*)PI2C_SR3)).bits.bit4
#define I2C_SR3_DUALF       (*((volatile DR8*)PI2C_SR3)).bits.bit7

#define PI2C_ITR            0x521A
#define I2C_ITR             (*((volatile DR8*)PI2C_ITR)).byte
#define I2C_ITR_ITERREN     (*((volatile DR8*)PI2C_ITR)).bits.bit0
#define I2C_ITR_ITEVTEN     (*((volatile DR8*)PI2C_ITR)).bits.bit1
#define I2C_ITR_ITBUFEN     (*((volatile DR8*)PI2C_ITR)).bits.bit2

#define PI2C_CCRL           0x521B
#define I2C_CCRL            (*((volatile DR8*)PI2C_CCRL)).byte

#define PI2C_CCRH           0x521C
#define I2C_CCRH            (*((volatile DR41*)PI2C_CCRH)).byte
#define I2C_CCRH_CCR        (*((volatile DR41*)PI2C_CCRH)).bits.bit03
#define I2C_CCRH_DUTY       (*((volatile DR41*)PI2C_CCRH)).bits.bit6
#define I2C_CCRH_F_S        (*((volatile DR41*)PI2C_CCRH)).bits.bit7

#define PI2C_TRISER         0x521D
#define I2C_TRISER          (*((volatile DR61*)PI2C_TRISER)).byte
#define I2C_TRISER_TRISE    (*((volatile DR61*)PI2C_TRISER)).bits.bit05

//------------------------------------------------------------------------
// UART (Universal asynchronous receiver transmitter) register definitions
//------------------------------------------------------------------------
#define PUART2_SR            0x5240
#define UART2_SR             (*((volatile DR8*)PUART2_SR)).byte
#define UART2_SR_PE          (*((volatile DR8*)PUART2_SR)).bits.bit0
#define UART2_SR_FE          (*((volatile DR8*)PUART2_SR)).bits.bit1
#define UART2_SR_NF          (*((volatile DR8*)PUART2_SR)).bits.bit2
#define UART2_SR_OR_LHE      (*((volatile DR8*)PUART2_SR)).bits.bit3
#define UART2_SR_IDLE        (*((volatile DR8*)PUART2_SR)).bits.bit4
#define UART2_SR_RXNE        (*((volatile DR8*)PUART2_SR)).bits.bit5
#define UART2_SR_TC          (*((volatile DR8*)PUART2_SR)).bits.bit6
#define UART2_SR_TXE         (*((volatile DR8*)PUART2_SR)).bits.bit7

#define PUART2_DR            0x5241
#define UART2_DR             (*((volatile DR8*)PUART2_DR)).byte

#define PUART2_BRR1          0x5242
#define UART2_BRR1           (*((volatile DR8*)PUART2_BRR1)).byte

#define PUART2_BRR2          0x5243
#define UART2_BRR2           (*((volatile DR8*)PUART2_BRR2)).byte

