Emile666/THD_Analyzer/stm8s105.h
#define PUART2_CR1           0x5244
#define UART2_CR1            (*((volatile DR8*)PUART2_CR1)).byte
#define UART2_CR1_PIEN       (*((volatile DR8*)PUART2_CR1)).bits.bit0
#define UART2_CR1_PS         (*((volatile DR8*)PUART2_CR1)).bits.bit1
#define UART2_CR1_PCEN       (*((volatile DR8*)PUART2_CR1)).bits.bit2
#define UART2_CR1_WAKE       (*((volatile DR8*)PUART2_CR1)).bits.bit3
#define UART2_CR1_M          (*((volatile DR8*)PUART2_CR1)).bits.bit4
#define UART2_CR1_UARTD      (*((volatile DR8*)PUART2_CR1)).bits.bit5
#define UART2_CR1_T8         (*((volatile DR8*)PUART2_CR1)).bits.bit6
#define UART2_CR1_R8         (*((volatile DR8*)PUART2_CR1)).bits.bit7

#define PUART2_CR2           0x5245
#define UART2_CR2            (*((volatile DR8*)PUART2_CR2)).byte
#define UART2_CR2_SBK        (*((volatile DR8*)PUART2_CR2)).bits.bit0
#define UART2_CR2_RWU        (*((volatile DR8*)PUART2_CR2)).bits.bit1
#define UART2_CR2_REN        (*((volatile DR8*)PUART2_CR2)).bits.bit2
#define UART2_CR2_TEN        (*((volatile DR8*)PUART2_CR2)).bits.bit3
#define UART2_CR2_ILIEN      (*((volatile DR8*)PUART2_CR2)).bits.bit4
#define UART2_CR2_RIEN       (*((volatile DR8*)PUART2_CR2)).bits.bit5
#define UART2_CR2_TCIEN      (*((volatile DR8*)PUART2_CR2)).bits.bit6
#define UART2_CR2_TIEN       (*((volatile DR8*)PUART2_CR2)).bits.bit7

#define PUART2_CR3           0x5246
#define UART2_CR3            (*((volatile DR111121*)PUART2_CR3)).byte
#define UART2_CR3_LBCL       (*((volatile DR111121*)PUART2_CR3)).bits.bit0
#define UART2_CR3_CPHA       (*((volatile DR111121*)PUART2_CR3)).bits.bit1
#define UART2_CR3_CPOL       (*((volatile DR111121*)PUART2_CR3)).bits.bit2
#define UART2_CR3_CKEN       (*((volatile DR111121*)PUART2_CR3)).bits.bit3
#define UART2_CR3_STOP       (*((volatile DR111121*)PUART2_CR3)).bits.bit45
#define UART2_CR3_LINEN      (*((volatile DR111121*)PUART2_CR3)).bits.bit6

#define PUART2_CR4           0x5247
#define UART2_CR4            (*((volatile DR41*)PUART2_CR4)).byte
#define UART2_CR4_ADD        (*((volatile DR41*)PUART2_CR4)).bits.bit03
#define UART2_CR4_LBDF       (*((volatile DR41*)PUART2_CR4)).bits.bit4
#define UART2_CR4_LBDL       (*((volatile DR41*)PUART2_CR4)).bits.bit5
#define UART2_CR4_LBDIEN     (*((volatile DR41*)PUART2_CR4)).bits.bit6

#define PUART2_CR5           0x5248
#define UART2_CR5            (*((volatile DR8*)PUART2_CR5)).byte
#define UART2_CR5_IREN       (*((volatile DR8*)PUART2_CR5)).bits.bit1
#define UART2_CR5_IRLP       (*((volatile DR8*)PUART2_CR5)).bits.bit2
#define UART2_CR5_HDSEL      (*((volatile DR8*)PUART2_CR5)).bits.bit3
#define UART2_CR5_NACK       (*((volatile DR8*)PUART2_CR5)).bits.bit4
#define UART2_CR5_SCEN       (*((volatile DR8*)PUART2_CR5)).bits.bit5

#define PUART2_CR6           0x5249
#define UART2_CR6            (*((volatile DR8*)PUART2_CR6)).byte
#define UART2_CR6_LSF        (*((volatile DR8*)PUART2_CR6)).bits.bit0
#define UART2_CR6_LHDF       (*((volatile DR8*)PUART2_CR6)).bits.bit1
#define UART2_CR6_LHDIEN     (*((volatile DR8*)PUART2_CR6)).bits.bit2
#define UART2_CR6_LASE       (*((volatile DR8*)PUART2_CR6)).bits.bit4
#define UART2_CR6_LSLV       (*((volatile DR8*)PUART2_CR6)).bits.bit5
#define UART2_CR6_LDUM       (*((volatile DR8*)PUART2_CR6)).bits.bit7

#define PUART2_GTR           0x524A
#define UART2_GTR            (*((volatile DR8*)PUART2_GTR)).byte

#define PUART2_PSCR          0x524B
#define UART2_PSCR           (*((volatile DR8*)PUART2_PSCR)).byte

//------------------------------------------------------------------------
// TIM1 (16-bit advanced control timer) register definitions
//------------------------------------------------------------------------
#define PTIM1_CR1            0x5250
#define TIM1_CR1             (*((volatile DR1111121*)PTIM1_CR1)).byte
#define TIM1_CR1_CEN         (*((volatile DR1111121*)PTIM1_CR1)).bits.bit0
#define TIM1_CR1_UDIS        (*((volatile DR1111121*)PTIM1_CR1)).bits.bit1
#define TIM1_CR1_URS         (*((volatile DR1111121*)PTIM1_CR1)).bits.bit2
#define TIM1_CR1_OPM         (*((volatile DR1111121*)PTIM1_CR1)).bits.bit3
#define TIM1_CR1_DIR         (*((volatile DR1111121*)PTIM1_CR1)).bits.bit4
#define TIM1_CR1_CMS         (*((volatile DR1111121*)PTIM1_CR1)).bits.bit56
#define TIM1_CR1_ARPE        (*((volatile DR1111121*)PTIM1_CR1)).bits.bit7

#define PTIM1_CR2            0x5251
#define TIM1_CR2             (*((volatile DR111131*)PTIM1_CR2)).byte
#define TIM1_CR2_CCPC        (*((volatile DR111131*)PTIM1_CR2)).bits.bit0
#define TIM1_CR2_COMS        (*((volatile DR111131*)PTIM1_CR2)).bits.bit2
#define TIM1_CR2_MMS         (*((volatile DR111131*)PTIM1_CR2)).bits.bit46

#define PTIM1_SMCR           0x5252
#define TIM1_SMCR            (*((volatile DR3131*)PTIM1_SMCR)).byte
#define TIM1_SMCR_SMS        (*((volatile DR3131*)PTIM1_SMCR)).bits.bit02
#define TIM1_SMCR_TS         (*((volatile DR3131*)PTIM1_SMCR)).bits.bit46
#define TIM1_SMCR_MSM        (*((volatile DR3131*)PTIM1_SMCR)).bits.bit7

#define PTIM1_ETR            0x5253
#define TIM1_ETR             (*((volatile DR42*)PTIM1_ETR)).byte
#define TIM1_ETR_ETF         (*((volatile DR42*)PTIM1_ETR)).bits.bit03
#define TIM1_ETR_ETPS        (*((volatile DR42*)PTIM1_ETR)).bits.bit45
#define TIM1_ETR_ECE         (*((volatile DR42*)PTIM1_ETR)).bits.bit6
#define TIM1_ETR_ETP         (*((volatile DR42*)PTIM1_ETR)).bits.bit7

#define PTIM1_IER            0x5254
#define TIM1_IER             (*((volatile DR8*)PTIM1_IER)).byte
#define TIM1_IER_UIE         (*((volatile DR8*)PTIM1_IER)).bits.bit0
#define TIM1_IER_CC1IE       (*((volatile DR8*)PTIM1_IER)).bits.bit1
#define TIM1_IER_CC2IE       (*((volatile DR8*)PTIM1_IER)).bits.bit2
#define TIM1_IER_CC3IE       (*((volatile DR8*)PTIM1_IER)).bits.bit3
#define TIM1_IER_CC4IE       (*((volatile DR8*)PTIM1_IER)).bits.bit4
#define TIM1_IER_COMIE       (*((volatile DR8*)PTIM1_IER)).bits.bit5
#define TIM1_IER_TIE         (*((volatile DR8*)PTIM1_IER)).bits.bit6
#define TIM1_IER_BIE         (*((volatile DR8*)PTIM1_IER)).bits.bit7

#define PTIM1_SR1            0x5255
#define TIM1_SR1             (*((volatile DR8*)PTIM1_SR1)).byte
#define TIM1_SR1_UIF         (*((volatile DR8*)PTIM1_SR1)).bits.bit0
#define TIM1_SR1_CC1IF       (*((volatile DR8*)PTIM1_SR1)).bits.bit1
#define TIM1_SR1_CC2IF       (*((volatile DR8*)PTIM1_SR1)).bits.bit2
#define TIM1_SR1_CC3IF       (*((volatile DR8*)PTIM1_SR1)).bits.bit3
#define TIM1_SR1_CC4IF       (*((volatile DR8*)PTIM1_SR1)).bits.bit4
#define TIM1_SR1_COMIF       (*((volatile DR8*)PTIM1_SR1)).bits.bit5
#define TIM1_SR1_TIF         (*((volatile DR8*)PTIM1_SR1)).bits.bit6
#define TIM1_SR1_BIF         (*((volatile DR8*)PTIM1_SR1)).bits.bit7

#define PTIM1_SR2            0x5256
#define TIM1_SR2             (*((volatile DR8*)PTIM1_SR2)).byte
#define TIM1_SR2_CC1OF       (*((volatile DR8*)PTIM1_SR2)).bits.bit1
#define TIM1_SR2_CC2OF       (*((volatile DR8*)PTIM1_SR2)).bits.bit2
#define TIM1_SR2_CC3OF       (*((volatile DR8*)PTIM1_SR2)).bits.bit3
#define TIM1_SR2_CC4OF       (*((volatile DR8*)PTIM1_SR2)).bits.bit4

#define PTIM1_EGR            0x5257
#define TIM1_EGR             (*((volatile DR8*)PTIM1_EGR)).byte
#define TIM1_EGR_UG          (*((volatile DR8*)PTIM1_EGR)).bits.bit0
#define TIM1_EGR_CC1G        (*((volatile DR8*)PTIM1_EGR)).bits.bit1
#define TIM1_EGR_CC2G        (*((volatile DR8*)PTIM1_EGR)).bits.bit2
#define TIM1_EGR_CC3G        (*((volatile DR8*)PTIM1_EGR)).bits.bit3
#define TIM1_EGR_CC4G        (*((volatile DR8*)PTIM1_EGR)).bits.bit4
#define TIM1_EGR_COMG        (*((volatile DR8*)PTIM1_EGR)).bits.bit5
#define TIM1_EGR_TG          (*((volatile DR8*)PTIM1_EGR)).bits.bit6
#define TIM1_EGR_BG          (*((volatile DR8*)PTIM1_EGR)).bits.bit7

