Emile666/THD_Analyzer/stm8s105.h
#define PTIM1_CCMR1          0x5258
#define TIM1_CCMR1           (*((volatile DR21131*)PTIM1_CCMR1)).byte
#define TIM1_CCMR1_CC1S      (*((volatile DR21131*)PTIM1_CCMR1)).bits.bit01 /* output & input */
#define TIM1_CCMR1_OC1FE     (*((volatile DR21131*)PTIM1_CCMR1)).bits.bit2  /* output */
#define TIM1_CCMR1_OC1PE     (*((volatile DR21131*)PTIM1_CCMR1)).bits.bit3  /* output */
#define TIM1_CCMR1_OC1M      (*((volatile DR21131*)PTIM1_CCMR1)).bits.bit46 /* output */
#define TIM1_CCMR1_OC1CE     (*((volatile DR21131*)PTIM1_CCMR1)).bits.bit7  /* output */
#define TIM1_CCMR1_IC1PSC    (*((volatile DR224*)PTIM1_CCMR1)).bits.bit23   /* input  */
#define TIM1_CCMR1_IC1F      (*((volatile DR224*)PTIM1_CCMR1)).bits.bit47   /* input  */

#define PTIM1_CCMR2          0x5259
#define TIM1_CCMR2           (*((volatile DR21131*)PTIM1_CCMR2)).byte
#define TIM1_CCMR2_CC2S      (*((volatile DR21131*)PTIM1_CCMR2)).bits.bit01 /* output & input */
#define TIM1_CCMR2_OC2FE     (*((volatile DR21131*)PTIM1_CCMR2)).bits.bit2  /* output */
#define TIM1_CCMR2_OC2PE     (*((volatile DR21131*)PTIM1_CCMR2)).bits.bit3  /* output */
#define TIM1_CCMR2_OC2M      (*((volatile DR21131*)PTIM1_CCMR2)).bits.bit46 /* output */
#define TIM1_CCMR2_OC2CE     (*((volatile DR21131*)PTIM1_CCMR2)).bits.bit7  /* output */
#define TIM1_CCMR2_IC2PSC    (*((volatile DR224*)PTIM1_CCMR2)).bits.bit23   /* input  */
#define TIM1_CCMR2_IC2F      (*((volatile DR224*)PTIM1_CCMR2)).bits.bit47   /* input  */

#define PTIM1_CCMR3          0x525A
#define TIM1_CCMR3           (*((volatile DR21131*)PTIM1_CCMR3)).byte
#define TIM1_CCMR3_CC3S      (*((volatile DR21131*)PTIM1_CCMR3)).bits.bit01 /* output & input */
#define TIM1_CCMR3_OC3FE     (*((volatile DR21131*)PTIM1_CCMR3)).bits.bit2  /* output */
#define TIM1_CCMR3_OC3PE     (*((volatile DR21131*)PTIM1_CCMR3)).bits.bit3  /* output */
#define TIM1_CCMR3_OC3M      (*((volatile DR21131*)PTIM1_CCMR3)).bits.bit46 /* output */
#define TIM1_CCMR3_OC3CE     (*((volatile DR21131*)PTIM1_CCMR3)).bits.bit7  /* output */
#define TIM1_CCMR3_IC3PSC    (*((volatile DR224*)PTIM1_CCMR3)).bits.bit23   /* input  */
#define TIM1_CCMR3_IC3F      (*((volatile DR224*)PTIM1_CCMR3)).bits.bit47   /* input  */

#define PTIM1_CCMR4          0x525B
#define TIM1_CCMR4           (*((volatile DR21131*)PTIM1_CCMR4)).byte
#define TIM1_CCMR4_CC4S      (*((volatile DR21131*)PTIM1_CCMR4)).bits.bit01 /* output & input */
#define TIM1_CCMR4_OC4FE     (*((volatile DR21131*)PTIM1_CCMR4)).bits.bit2  /* output */
#define TIM1_CCMR4_OC4PE     (*((volatile DR21131*)PTIM1_CCMR4)).bits.bit3  /* output */
#define TIM1_CCMR4_OC4M      (*((volatile DR21131*)PTIM1_CCMR4)).bits.bit46 /* output */
#define TIM1_CCMR4_OC4CE     (*((volatile DR21131*)PTIM1_CCMR4)).bits.bit7  /* output */
#define TIM1_CCMR4_IC4PSC    (*((volatile DR224*)PTIM1_CCMR4)).bits.bit23   /* input  */
#define TIM1_CCMR4_IC4F      (*((volatile DR224*)PTIM1_CCMR4)).bits.bit47   /* input  */

#define PTIM1_CCER1          0x525C
#define TIM1_CCER1           (*((volatile DR8*)PTIM1_CCER1)).byte
#define TIM1_CCER1_CC1E      (*((volatile DR8*)PTIM1_CCER1)).bits.bit0
#define TIM1_CCER1_CC1P      (*((volatile DR8*)PTIM1_CCER1)).bits.bit1
#define TIM1_CCER1_CC1NE     (*((volatile DR8*)PTIM1_CCER1)).bits.bit2
#define TIM1_CCER1_CC1NP     (*((volatile DR8*)PTIM1_CCER1)).bits.bit3
#define TIM1_CCER1_CC2E      (*((volatile DR8*)PTIM1_CCER1)).bits.bit4
#define TIM1_CCER1_CC2P      (*((volatile DR8*)PTIM1_CCER1)).bits.bit5
#define TIM1_CCER1_CC2NE     (*((volatile DR8*)PTIM1_CCER1)).bits.bit6
#define TIM1_CCER1_CC2NP     (*((volatile DR8*)PTIM1_CCER1)).bits.bit7

#define PTIM1_CCER2          0x525D
#define TIM1_CCER2           (*((volatile DR8*)PTIM1_CCER2)).byte
#define TIM1_CCER2_CC3E      (*((volatile DR8*)PTIM1_CCER2)).bits.bit0
#define TIM1_CCER2_CC3P      (*((volatile DR8*)PTIM1_CCER2)).bits.bit1
#define TIM1_CCER2_CC3NE     (*((volatile DR8*)PTIM1_CCER2)).bits.bit2
#define TIM1_CCER2_CC3NP     (*((volatile DR8*)PTIM1_CCER2)).bits.bit3
#define TIM1_CCER2_CC4E      (*((volatile DR8*)PTIM1_CCER2)).bits.bit4
#define TIM1_CCER2_CC4P      (*((volatile DR8*)PTIM1_CCER2)).bits.bit5

#define PTIM1_CNTRH          0x525E
#define TIM1_CNTRH           (*((volatile DR8*)PTIM1_CNTRH)).byte

#define PTIM1_CNTRL          0x525F
#define TIM1_CNTRL           (*((volatile DR8*)PTIM1_CNTRL)).byte

#define PTIM1_PSCRH          0x5260
#define TIM1_PSCRH           (*((volatile DR8*)PTIM1_PSCRH)).byte

#define PTIM1_PSCRL          0x5261
#define TIM1_PSCRL           (*((volatile DR8*)PTIM1_PSCRL)).byte

#define PTIM1_ARRH           0x5262
#define TIM1_ARRH            (*((volatile DR8*)PTIM1_ARRH)).byte

#define PTIM1_ARRL           0x5263
#define TIM1_ARRL            (*((volatile DR8*)PTIM1_ARRL)).byte

#define PTIM1_RCR            0x5264
#define TIM1_RCR             (*((volatile DR8*)PTIM1_RCR)).byte

#define PTIM1_CCR1H          0x5265
#define TIM1_CCR1H           (*((volatile DR8*)PTIM1_CCR1H)).byte

#define PTIM1_CCR1L          0x5266
#define TIM1_CCR1L           (*((volatile DR8*)PTIM1_CCR1L)).byte

#define PTIM1_CCR2H          0x5267
#define TIM1_CCR2H           (*((volatile DR8*)PTIM1_CCR2H)).byte

#define PTIM1_CCR2L          0x5268
#define TIM1_CCR2L           (*((volatile DR8*)PTIM1_CCR2L)).byte

#define PTIM1_CCR3H          0x5269
#define TIM1_CCR3H           (*((volatile DR8*)PTIM1_CCR3H)).byte

#define PTIM1_CCR3L          0x526A
#define TIM1_CCR3L           (*((volatile DR8*)PTIM1_CCR3L)).byte

#define PTIM1_CCR4H          0x526B
#define TIM1_CCR4H           (*((volatile DR8*)PTIM1_CCR4H)).byte

#define PTIM1_CCR4L          0x526C
#define TIM1_CCR4L           (*((volatile DR8*)PTIM1_CCR4L)).byte

#define PTIM1_BKR            0x526D
#define TIM1_BKR             (*((volatile DR21*)PTIM1_BKR)).byte
#define TIM1_BKR_LOCK        (*((volatile DR21*)PTIM1_BKR)).bits.bit01
#define TIM1_BKR_OSSI        (*((volatile DR21*)PTIM1_BKR)).bits.bit2
#define TIM1_BKR_OSSR        (*((volatile DR21*)PTIM1_BKR)).bits.bit3
#define TIM1_BKR_BKE         (*((volatile DR21*)PTIM1_BKR)).bits.bit4
#define TIM1_BKR_BKP         (*((volatile DR21*)PTIM1_BKR)).bits.bit5
#define TIM1_BKR_AOE         (*((volatile DR21*)PTIM1_BKR)).bits.bit6
#define TIM1_BKR_MOE         (*((volatile DR21*)PTIM1_BKR)).bits.bit7

#define PTIM1_DTR            0x526E
#define TIM1_DTR             (*((volatile DR8*)PTIM1_DTR)).byte

#define PTIM1_OISR           0x526F
#define TIM1_OISR            (*((volatile DR8*)PTIM1_OISR)).byte
#define TIM1_OISR_OIS1       (*((volatile DR8*)PTIM1_OISR)).bits.bit0
#define TIM1_OISR_OIS1N      (*((volatile DR8*)PTIM1_OISR)).bits.bit1
#define TIM1_OISR_OIS2       (*((volatile DR8*)PTIM1_OISR)).bits.bit2
#define TIM1_OISR_OIS2N      (*((volatile DR8*)PTIM1_OISR)).bits.bit3
#define TIM1_OISR_OIS3       (*((volatile DR8*)PTIM1_OISR)).bits.bit4
#define TIM1_OISR_OIS3N      (*((volatile DR8*)PTIM1_OISR)).bits.bit5
#define TIM1_OISR_OIS4       (*((volatile DR8*)PTIM1_OISR)).bits.bit6

//------------------------------------------------------------------------
// TIM2 (16-bit general purpose timer) register definitions
//------------------------------------------------------------------------
#define PTIM2_CR1            0x5300
#define TIM2_CR1             (*((volatile DR8*)PTIM2_CR1)).byte
#define TIM2_CR1_CEN         (*((volatile DR8*)PTIM2_CR1)).bits.bit0
#define TIM2_CR1_UDIS        (*((volatile DR8*)PTIM2_CR1)).bits.bit1
#define TIM2_CR1_URS         (*((volatile DR8*)PTIM2_CR1)).bits.bit2
#define TIM2_CR1_OPM         (*((volatile DR8*)PTIM2_CR1)).bits.bit3
#define TIM2_CR1_ARPE        (*((volatile DR8*)PTIM2_CR1)).bits.bit7

