Emile666/THD_Analyzer/stm8s105.h
#define PTIM2_IER            0x5301
#define TIM2_IER             (*((volatile DR8*)PTIM2_IER)).byte
#define TIM2_IER_UIE         (*((volatile DR8*)PTIM2_IER)).bits.bit0
#define TIM2_IER_CC1IE       (*((volatile DR8*)PTIM2_IER)).bits.bit1
#define TIM2_IER_CC2IE       (*((volatile DR8*)PTIM2_IER)).bits.bit2
#define TIM2_IER_CC3IE       (*((volatile DR8*)PTIM2_IER)).bits.bit3
#define TIM2_IER_TIE         (*((volatile DR8*)PTIM2_IER)).bits.bit6

#define PTIM2_SR1            0x5302
#define TIM2_SR1             (*((volatile DR8*)PTIM2_SR1)).byte
#define TIM2_SR1_UIF         (*((volatile DR8*)PTIM2_SR1)).bits.bit0
#define TIM2_SR1_CC1IF       (*((volatile DR8*)PTIM2_SR1)).bits.bit1
#define TIM2_SR1_CC2IF       (*((volatile DR8*)PTIM2_SR1)).bits.bit2
#define TIM2_SR1_CC3IF       (*((volatile DR8*)PTIM2_SR1)).bits.bit3
#define TIM2_SR1_TIF         (*((volatile DR8*)PTIM2_SR1)).bits.bit6

#define PTIM2_SR2            0x5303
#define TIM2_SR2             (*((volatile DR8*)PTIM2_SR2)).byte
#define TIM2_SR2_CC1OF       (*((volatile DR8*)PTIM2_SR2)).bits.bit1
#define TIM2_SR2_CC2OF       (*((volatile DR8*)PTIM2_SR2)).bits.bit2
#define TIM2_SR2_CC3OF       (*((volatile DR8*)PTIM2_SR2)).bits.bit3

#define PTIM2_EGR            0x5304
#define TIM2_EGR             (*((volatile DR8*)PTIM2_EGR)).byte
#define TIM2_EGR_UG          (*((volatile DR8*)PTIM2_EGR)).bits.bit0
#define TIM2_EGR_CC1G        (*((volatile DR8*)PTIM2_EGR)).bits.bit1
#define TIM2_EGR_CC2G        (*((volatile DR8*)PTIM2_EGR)).bits.bit2
#define TIM2_EGR_CC3G        (*((volatile DR8*)PTIM2_EGR)).bits.bit3
#define TIM2_EGR_TG          (*((volatile DR8*)PTIM2_EGR)).bits.bit6

#define PTIM2_CCMR1          0x5305
#define TIM2_CCMR1           (*((volatile DR21131*)PTIM2_CCMR1)).byte
#define TIM2_CCMR1_CC1S      (*((volatile DR21131*)PTIM2_CCMR1)).bits.bit01 /* output & input */
#define TIM2_CCMR1_OC1PE     (*((volatile DR21131*)PTIM2_CCMR1)).bits.bit3  /* output */
#define TIM2_CCMR1_OC1M      (*((volatile DR21131*)PTIM2_CCMR1)).bits.bit46 /* output */
#define TIM2_CCMR1_IC1PSC    (*((volatile DR224*)PTIM2_CCMR1)).bits.bit23   /* input  */
#define TIM2_CCMR1_IC1F      (*((volatile DR224*)PTIM2_CCMR1)).bits.bit47   /* input  */

#define PTIM2_CCMR2          0x5306
#define TIM2_CCMR2           (*((volatile DR21131*)PTIM2_CCMR2)).byte
#define TIM2_CCMR2_CC2S      (*((volatile DR21131*)PTIM2_CCMR2)).bits.bit01 /* output & input */
#define TIM2_CCMR2_OC2PE     (*((volatile DR21131*)PTIM2_CCMR2)).bits.bit3  /* output */
#define TIM2_CCMR2_OC2M      (*((volatile DR21131*)PTIM2_CCMR2)).bits.bit46 /* output */
#define TIM2_CCMR2_IC2PSC    (*((volatile DR224*)PTIM2_CCMR2)).bits.bit23   /* input  */
#define TIM2_CCMR2_IC2F      (*((volatile DR224*)PTIM2_CCMR2)).bits.bit47   /* input  */

#define PTIM2_CCMR3          0x5307
#define TIM2_CCMR3           (*((volatile DR21131*)PTIM2_CCMR3)).byte
#define TIM2_CCMR3_CC3S      (*((volatile DR21131*)PTIM2_CCMR3)).bits.bit01 /* output & input */
#define TIM2_CCMR3_OC3PE     (*((volatile DR21131*)PTIM2_CCMR3)).bits.bit3  /* output */
#define TIM2_CCMR3_OC3M      (*((volatile DR21131*)PTIM2_CCMR3)).bits.bit46 /* output */
#define TIM2_CCMR3_IC3PSC    (*((volatile DR224*)PTIM2_CCMR3)).bits.bit23   /* input  */
#define TIM2_CCMR3_IC3F      (*((volatile DR224*)PTIM2_CCMR3)).bits.bit47   /* input  */

#define PTIM2_CCER1          0x5308
#define TIM2_CCER1           (*((volatile DR8*)PTIM2_CCER1)).byte
#define TIM2_CCER1_CC1E      (*((volatile DR8*)PTIM2_CCER1)).bits.bit0
#define TIM2_CCER1_CC1P      (*((volatile DR8*)PTIM2_CCER1)).bits.bit1
#define TIM2_CCER1_CC2E      (*((volatile DR8*)PTIM2_CCER1)).bits.bit4
#define TIM2_CCER1_CC2P      (*((volatile DR8*)PTIM2_CCER1)).bits.bit5

#define PTIM2_CCER2          0x5309
#define TIM2_CCER2           (*((volatile DR8*)PTIM2_CCER2)).byte
#define TIM2_CCER2_CC3E      (*((volatile DR8*)PTIM2_CCER2)).bits.bit0
#define TIM2_CCER2_CC3P      (*((volatile DR8*)PTIM2_CCER2)).bits.bit1

#define PTIM2_CNTRH          0x530A
#define TIM2_CNTRH           (*((volatile DR8*)PTIM2_CNTRH)).byte

#define PTIM2_CNTRL          0x530B
#define TIM2_CNTRL           (*((volatile DR8*)PTIM2_CNTRL)).byte

#define PTIM2_PSCR           0x530C
#define TIM2_PSCR            (*((volatile DR41*)PTIM2_PSCR)).byte
#define TIM2_PSCR_PSC        (*((volatile DR41*)PTIM2_PSCR)).bits.bit03

#define PTIM2_ARRH           0x530D
#define TIM2_ARRH            (*((volatile DR8*)PTIM2_ARRH)).byte

#define PTIM2_ARRL           0x530E
#define TIM2_ARRL            (*((volatile DR8*)PTIM2_ARRL)).byte

#define PTIM2_CCR1H          0x530F
#define TIM2_CCR1H           (*((volatile DR8*)PTIM2_CCR1H)).byte

#define PTIM2_CCR1L          0x5310
#define TIM2_CCR1L           (*((volatile DR8*)PTIM2_CCR1L)).byte

#define PTIM2_CCR2H          0x5311
#define TIM2_CCR2H           (*((volatile DR8*)PTIM2_CCR2H)).byte

#define PTIM2_CCR2L          0x5312
#define TIM2_CCR2L           (*((volatile DR8*)PTIM2_CCR2L)).byte

#define PTIM2_CCR3H          0x5313
#define TIM2_CCR3H           (*((volatile DR8*)PTIM2_CCR3H)).byte

#define PTIM2_CCR3L          0x5314
#define TIM2_CCR3L           (*((volatile DR8*)PTIM2_CCR3L)).byte

//------------------------------------------------------------------------
// TIM3 (16-bit general purpose timer) register definitions
//------------------------------------------------------------------------
#define PTIM3_CR1            0x5320
#define TIM3_CR1             (*((volatile DR8*)PTIM3_CR1)).byte
#define TIM3_CR1_CEN         (*((volatile DR8*)PTIM3_CR1)).bits.bit0
#define TIM3_CR1_UDIS        (*((volatile DR8*)PTIM3_CR1)).bits.bit1
#define TIM3_CR1_URS         (*((volatile DR8*)PTIM3_CR1)).bits.bit2
#define TIM3_CR1_OPM         (*((volatile DR8*)PTIM3_CR1)).bits.bit3
#define TIM3_CR1_ARPE        (*((volatile DR8*)PTIM3_CR1)).bits.bit7

#define PTIM3_IER            0x5321
#define TIM3_IER             (*((volatile DR8*)PTIM3_IER)).byte
#define TIM3_IER_UIE         (*((volatile DR8*)PTIM3_IER)).bits.bit0
#define TIM3_IER_CC1IE       (*((volatile DR8*)PTIM3_IER)).bits.bit1
#define TIM3_IER_CC2IE       (*((volatile DR8*)PTIM3_IER)).bits.bit2
#define TIM3_IER_CC3IE       (*((volatile DR8*)PTIM3_IER)).bits.bit3
#define TIM3_IER_TIE         (*((volatile DR8*)PTIM3_IER)).bits.bit6

