Emile666/THD_Analyzer/stm8s105.h
#define PTIM3_SR1            0x5322
#define TIM3_SR1             (*((volatile DR8*)PTIM3_SR1)).byte
#define TIM3_SR1_UIF         (*((volatile DR8*)PTIM3_SR1)).bits.bit0
#define TIM3_SR1_CC1IF       (*((volatile DR8*)PTIM3_SR1)).bits.bit1
#define TIM3_SR1_CC2IF       (*((volatile DR8*)PTIM3_SR1)).bits.bit2
#define TIM3_SR1_CC3IF       (*((volatile DR8*)PTIM3_SR1)).bits.bit3
#define TIM3_SR1_TIF         (*((volatile DR8*)PTIM3_SR1)).bits.bit6

#define PTIM3_SR2            0x5323
#define TIM3_SR2             (*((volatile DR8*)PTIM3_SR2)).byte
#define TIM3_SR2_CC1OF       (*((volatile DR8*)PTIM3_SR2)).bits.bit1
#define TIM3_SR2_CC2OF       (*((volatile DR8*)PTIM3_SR2)).bits.bit2
#define TIM3_SR2_CC3OF       (*((volatile DR8*)PTIM3_SR2)).bits.bit3

#define PTIM3_EGR            0x5324
#define TIM3_EGR             (*((volatile DR8*)PTIM3_EGR)).byte
#define TIM3_EGR_UG          (*((volatile DR8*)PTIM3_EGR)).bits.bit0
#define TIM3_EGR_CC1G        (*((volatile DR8*)PTIM3_EGR)).bits.bit1
#define TIM3_EGR_CC2G        (*((volatile DR8*)PTIM3_EGR)).bits.bit2
#define TIM3_EGR_CC3G        (*((volatile DR8*)PTIM3_EGR)).bits.bit3
#define TIM3_EGR_TG          (*((volatile DR8*)PTIM3_EGR)).bits.bit6

#define PTIM3_CCMR1          0x5325
#define TIM3_CCMR1           (*((volatile DR21131*)PTIM3_CCMR1)).byte
#define TIM3_CCMR1_CC1S      (*((volatile DR21131*)PTIM3_CCMR1)).bits.bit01 /* output & input */
#define TIM3_CCMR1_OC1PE     (*((volatile DR21131*)PTIM3_CCMR1)).bits.bit3  /* output */
#define TIM3_CCMR1_OC1M      (*((volatile DR21131*)PTIM3_CCMR1)).bits.bit46 /* output */
#define TIM3_CCMR1_IC1PSC    (*((volatile DR224*)PTIM3_CCMR1)).bits.bit23   /* input  */
#define TIM3_CCMR1_IC1F      (*((volatile DR224*)PTIM3_CCMR1)).bits.bit47   /* input  */

#define PTIM3_CCMR2          0x5326
#define TIM3_CCMR2           (*((volatile DR21131*)PTIM3_CCMR2)).byte
#define TIM3_CCMR2_CC2S      (*((volatile DR21131*)PTIM3_CCMR2)).bits.bit01 /* output & input */
#define TIM3_CCMR2_OC2PE     (*((volatile DR21131*)PTIM3_CCMR2)).bits.bit3  /* output */
#define TIM3_CCMR2_OC2M      (*((volatile DR21131*)PTIM3_CCMR2)).bits.bit46 /* output */
#define TIM3_CCMR2_IC2PSC    (*((volatile DR224*)PTIM3_CCMR2)).bits.bit23   /* input  */
#define TIM3_CCMR2_IC2F      (*((volatile DR224*)PTIM3_CCMR2)).bits.bit47   /* input  */

#define PTIM3_CCER1          0x5327
#define TIM3_CCER1           (*((volatile DR8*)PTIM3_CCER1)).byte
#define TIM3_CCER1_CC1E      (*((volatile DR8*)PTIM3_CCER1)).bits.bit0
#define TIM3_CCER1_CC1P      (*((volatile DR8*)PTIM3_CCER1)).bits.bit1
#define TIM3_CCER1_CC2E      (*((volatile DR8*)PTIM3_CCER1)).bits.bit4
#define TIM3_CCER1_CC2P      (*((volatile DR8*)PTIM3_CCER1)).bits.bit5

#define PTIM3_CNTRH          0x5328
#define TIM3_CNTRH           (*((volatile DR8*)PTIM3_CNTRH)).byte

#define PTIM3_CNTRL          0x5329
#define TIM3_CNTRL           (*((volatile DR8*)PTIM3_CNTRL)).byte

#define PTIM3_PSCR           0x532A
#define TIM3_PSCR            (*((volatile DR41*)PTIM3_PSCR)).byte
#define TIM3_PSCR_PSC        (*((volatile DR41*)PTIM3_PSCR)).bits.bit03

#define PTIM3_ARRH           0x532B
#define TIM3_ARRH            (*((volatile DR8*)PTIM3_ARRH)).byte

#define PTIM3_ARRL           0x532C
#define TIM3_ARRL            (*((volatile DR8*)PTIM3_ARRL)).byte
#define PTIM3_CCR1H          0x532D

#define TIM3_CCR1H           (*((volatile DR8*)PTIM3_CCR1H)).byte

#define PTIM3_CCR1L          0x532E
#define TIM3_CCR1L           (*((volatile DR8*)PTIM3_CCR1L)).byte

#define PTIM3_CCR2H          0x532F
#define TIM3_CCR2H           (*((volatile DR8*)PTIM3_CCR2H)).byte

#define PTIM3_CCR2L          0x5330
#define TIM3_CCR2L           (*((volatile DR8*)PTIM3_CCR2L)).byte

//------------------------------------------------------------------------
// TIM4 (8-bit basic timer) register definitions
//------------------------------------------------------------------------
#define PTIM4_CR1            0x5340
#define TIM4_CR1             (*((volatile DR8*)PTIM4_CR1)).byte
#define TIM4_CR1_CEN         (*((volatile DR8*)PTIM4_CR1)).bits.bit0
#define TIM4_CR1_UDIS        (*((volatile DR8*)PTIM4_CR1)).bits.bit1
#define TIM4_CR1_URS         (*((volatile DR8*)PTIM4_CR1)).bits.bit2
#define TIM4_CR1_OPM         (*((volatile DR8*)PTIM4_CR1)).bits.bit3
#define TIM4_CR1_ARPE        (*((volatile DR8*)PTIM4_CR1)).bits.bit7

#define PTIM4_IER            0x5341
#define TIM4_IER             (*((volatile DR8*)PTIM4_IER)).byte
#define TIM4_IER_UIE         (*((volatile DR8*)PTIM4_IER)).bits.bit0
#define TIM4_IER_TIE         (*((volatile DR8*)PTIM4_IER)).bits.bit6

#define PTIM4_SR1            0x5342
#define TIM4_SR1             (*((volatile DR8*)PTIM4_SR1)).byte
#define TIM4_SR1_UIF         (*((volatile DR8*)PTIM4_SR1)).bits.bit0
#define TIM4_SR1_TIF         (*((volatile DR8*)PTIM4_SR1)).bits.bit6

#define PTIM4_EGR            0x5343
#define TIM4_EGR             (*((volatile DR8*)PTIM4_EGR)).byte
#define TIM4_EGR_UG          (*((volatile DR8*)PTIM4_EGR)).bits.bit0
#define TIM4_EGR_TG          (*((volatile DR8*)PTIM4_EGR)).bits.bit6

#define PTIM4_CNTR           0x5344
#define TIM4_CNTR            (*((volatile DR8*)PTIM4_CNTR)).byte

#define PTIM4_PSCR           0x5345
#define TIM4_PSCR            (*((volatile DR3131*)PTIM4_PSCR)).byte
#define TIM4_PSCR_PSC        (*((volatile DR3131*)PTIM4_PSCR)).bits.bit02

#define PTIM4_ARR            0x5346
#define TIM4_ARR             (*((volatile DR8*)PTIM4_ARR)).byte

//------------------------------------------------------------------------
// ADC1 (analog/digital converter) register definitions
//------------------------------------------------------------------------
#define PADC_DB0RH           0x53E0
#define ADC_DB0RH            (*((volatile DR8*)PADC_DB0RH)).byte

#define PADC_DB0RL           0x53E1
#define ADC_DB0RL            (*((volatile DR8*)PADC_DB0RL)).byte

#define PADC_DB1RH           0x53E2
#define ADC_DB1RH            (*((volatile DR8*)PADC_DB1RH)).byte

#define PADC_DB1RL           0x53E3
#define ADC_DB1RL            (*((volatile DR8*)PADC_DB1RL)).byte

#define PADC_DB2RH           0x53E4
#define ADC_DB2RH            (*((volatile DR8*)PADC_DB2RH)).byte

#define PADC_DB2RL           0x53E5
#define ADC_DB2RL            (*((volatile DR8*)PADC_DB2RL)).byte

#define PADC_DB3RH           0x53E6
#define ADC_DB3RH            (*((volatile DR8*)PADC_DB3RH)).byte

#define PADC_DB3RL           0x53E7
#define ADC_DB3RL            (*((volatile DR8*)PADC_DB3RL)).byte

#define PADC_DB4RH           0x53E8
#define ADC_DB4RH            (*((volatile DR8*)PADC_DB4RH)).byte

#define PADC_DB4RL           0x53E9
#define ADC_DB4RL            (*((volatile DR8*)PADC_DB4RL)).byte

#define PADC_DB5RH           0x53EA
#define ADC_DB5RH            (*((volatile DR8*)PADC_DB5RH)).byte

#define PADC_DB5RL           0x53EB
#define ADC_DB5RL            (*((volatile DR8*)PADC_DB5RL)).byte

#define PADC_DB6RH           0x53EC
#define ADC_DB6RH            (*((volatile DR8*)PADC_DB6RH)).byte

