Emile666/THD_Analyzer/stm8s105.h
#define PADC_DB6RL           0x53ED
#define ADC_DB6RL            (*((volatile DR8*)PADC_DB6RL)).byte

#define PADC_DB7RH           0x53EE
#define ADC_DB7RH            (*((volatile DR8*)PADC_DB7RH)).byte

#define PADC_DB7RL           0x53EF
#define ADC_DB7RL            (*((volatile DR8*)PADC_DB7RL)).byte

#define PADC_DB8RH           0x53F0
#define ADC_DB8RH            (*((volatile DR8*)PADC_DB8RH)).byte

#define PADC_DB8RL           0x53F1
#define ADC_DB8RL            (*((volatile DR8*)PADC_DB8RL)).byte

#define PADC_DB9RH           0x53F2
#define ADC_DB9RH            (*((volatile DR8*)PADC_DB9RH)).byte

#define PADC_DB9RL           0x53F3
#define ADC_DB9RL            (*((volatile DR8*)PADC_DB9RL)).byte

#define PADC_CSR             0x5400
#define ADC_CSR              (*((volatile DR41*)PADC_CSR)).byte
#define ADC_CSR_CH           (*((volatile DR41*)PADC_CSR)).bits.bit03
#define ADC_CSR_AWDIE        (*((volatile DR41*)PADC_CSR)).bits.bit4
#define ADC_CSR_EOCIE        (*((volatile DR41*)PADC_CSR)).bits.bit5
#define ADC_CSR_AWD          (*((volatile DR41*)PADC_CSR)).bits.bit6
#define ADC_CSR_EOC          (*((volatile DR41*)PADC_CSR)).bits.bit7

#define PADC_CR1             0x5401
#define ADC_CR1              (*((volatile DR111131*)PADC_CR1)).byte
#define ADC_CR1_ADON         (*((volatile DR111131*)PADC_CR1)).bits.bit0
#define ADC_CR1_CONT         (*((volatile DR111131*)PADC_CR1)).bits.bit1
#define ADC_CR1_SPSEL        (*((volatile DR111131*)PADC_CR1)).bits.bit46

#define PADC_CR2             0x5402
#define ADC_CR2              (*((volatile DR111121*)PADC_CR2)).byte
#define ADC_CR2_SCAN         (*((volatile DR111121*)PADC_CR2)).bits.bit1
#define ADC_CR2_ALIGN        (*((volatile DR111121*)PADC_CR2)).bits.bit3
#define ADC_CR2_EXTSEL       (*((volatile DR111121*)PADC_CR2)).bits.bit45
#define ADC_CR2_EXTTRIG      (*((volatile DR111121*)PADC_CR2)).bits.bit6

#define PADC_CR3             0x5403
#define ADC_CR3              (*((volatile DR8*)PADC_CR3)).byte
#define ADC_CR3_OVR          (*((volatile DR8*)PADC_CR3)).bits.bit6
#define ADC_CR3_DBUF         (*((volatile DR8*)PADC_CR3)).bits.bit7

#define PADC_DRH             0x5404
#define ADC_DRH              (*((volatile DR8*)PADC_DRH)).byte

#define PADC_DRL             0x5405
#define ADC_DRL              (*((volatile DR8*)PADC_DRL)).byte

#define PADC_TDRH            0x5406
#define ADC_TDRH             (*((volatile DR8*)PADC_TDRH)).byte

#define PADC_TDRL            0x5407
#define ADC_TDRL             (*((volatile DR8*)PADC_TDRL)).byte

#define PADC_HTRH            0x5408
#define ADC_HTRH             (*((volatile DR8*)PADC_HTRH)).byte

#define PADC_HTRL            0x5409
#define ADC_HTRL             (*((volatile DR21*)PADC_HTRL)).byte
#define ADC_HTRL_HT          (*((volatile DR21*)PADC_HTRL)).bits.bit01

#define PADC_LTRH            0x540A
#define ADC_LTRH             (*((volatile DR8*)PADC_LTRH)).byte

#define PADC_LTRL            0x540B
#define ADC_LTRL             (*((volatile DR21*)PADC_LTRL)).byte
#define ADC_LTRL_LT          (*((volatile DR21*)PADC_LTRL)).bit01

#define PADC_AWSRH           0x540C
#define ADC_AWSRH            (*((volatile DR8*)PADC_AWSRH)).byte
#define ADC_AWSRH_AWS8       (*((volatile DR8*)PADC_AWSRH)).bits.bit0
#define ADC_AWSRH_AWS9       (*((volatile DR8*)PADC_AWSRH)).bits.bit1

#define PADC_AWSRL           0x540D
#define ADC_AWSRL            (*((volatile DR8*)PADC_AWSRL)).byte
#define ADC_AWSRL_AWS0       (*((volatile DR8*)PADC_AWSRL)).bit0
#define ADC_AWSRL_AWS1       (*((volatile DR8*)PADC_AWSRL)).bit1
#define ADC_AWSRL_AWS2       (*((volatile DR8*)PADC_AWSRL)).bit2
#define ADC_AWSRL_AWS3       (*((volatile DR8*)PADC_AWSRL)).bit3
#define ADC_AWSRL_AWS4       (*((volatile DR8*)PADC_AWSRL)).bit4
#define ADC_AWSRL_AWS5       (*((volatile DR8*)PADC_AWSRL)).bit5
#define ADC_AWSRL_AWS6       (*((volatile DR8*)PADC_AWSRL)).bit6
#define ADC_AWSRL_AWS7       (*((volatile DR8*)PADC_AWSRL)).bit7

#define PADC_AWCRH           0x540E
#define ADC_AWCRH            (*((volatile DR8*)PADC_AWCRH)).byte
#define ADC_AWCRH_AWEN8      (*((volatile DR8*)PADC_AWCRH)).bits.bit0
#define ADC_AWCRH_AWEN9      (*((volatile DR8*)PADC_AWCRH)).bits.bit1

#define PADC_AWCRL           0x540F
#define ADC_AWCRL            (*((volatile DR8*)PADC_AWCRL)).byte
#define ADC_AWCRL_AWEN0      (*((volatile DR8*)PADC_AWCRL)).bits.bit0
#define ADC_AWCRL_AWEN1      (*((volatile DR8*)PADC_AWCRL)).bits.bit1
#define ADC_AWCRL_AWEN2      (*((volatile DR8*)PADC_AWCRL)).bits.bit2
#define ADC_AWCRL_AWEN3      (*((volatile DR8*)PADC_AWCRL)).bits.bit3
#define ADC_AWCRL_AWEN4      (*((volatile DR8*)PADC_AWCRL)).bits.bit4
#define ADC_AWCRL_AWEN5      (*((volatile DR8*)PADC_AWCRL)).bits.bit5
#define ADC_AWCRL_AWEN6      (*((volatile DR8*)PADC_AWCRL)).bits.bit6
#define ADC_AWCRL_AWEN7      (*((volatile DR8*)PADC_AWCRL)).bits.bit7

//------------------------------------------------------------------------
// CPU register definitions
//------------------------------------------------------------------------
#define PCPU_A               0x7F00
#define CPU_A                (*((volatile DR8*)PCPU_A)).byte   /* Accumulator */

#define PCPU_PCE             0x7F01
#define CPU_PCE              (*((volatile DR8*)PCPU_PCE)).byte /* Program counter extended */

#define PCPU_PCH             0x7F02
#define CPU_PCH              (*((volatile DR8*)PCPU_PCH)).byte /* Program counter high */

#define PCPU_PCL             0x7F03
#define CPU_PCL              (*((volatile DR8*)PCPU_PCL)).byte /* Program counter low */

#define PCPU_XH              0x7F04
#define CPU_XH               (*((volatile DR8*)PCPU_XH)).byte  /* X index register high */

#define PCPU_XL              0x7F05
#define CPU_XL               (*((volatile DR8*)PCPU_XL)).byte  /* X index register low */

#define PCPU_YH              0x7F06
#define CPU_YH               (*((volatile DR8*)PCPU_YH)).byte  /* Y index register high */

#define PCPU_YL              0x7F07
#define CPU_YL               (*((volatile DR8*)PCPU_YL)).byte  /* Y index register low */

#define PCPU_SPH             0x7F08
#define CPU_SPH              (*((volatile DR8*)PCPU_SPH)).byte  /* Stack pointer high */

#define PCPU_SPL             0x7F09
#define CPU_SPL              (*((volatile DR8*)PCPU_SPL)).byte  /* Stack pointer low */

