Emile666/THD_Analyzer/stm8s105.h
#define PCPU_CCR             0x7F0A
#define CPU_CCR              (*((volatile DR8*)PCPU_CCR)).byte  /* Condition code register */
#define CPU_CCR_C            (*((volatile DR8*)PCPU_CCR)).bits.bit0
#define CPU_CCR_Z            (*((volatile DR8*)PCPU_CCR)).bits.bit1
#define CPU_CCR_NF           (*((volatile DR8*)PCPU_CCR)).bits.bit2
#define CPU_CCR_I0           (*((volatile DR8*)PCPU_CCR)).bits.bit3
#define CPU_CCR_H            (*((volatile DR8*)PCPU_CCR)).bits.bit4
#define CPU_CCR_I1           (*((volatile DR8*)PCPU_CCR)).bits.bit5
#define CPU_CCR_V            (*((volatile DR8*)PCPU_CCR)).bits.bit7

#define PCPU_CFG_GCR         0x7F60
#define CPU_CFG_GCR          (*((volatile DR8*)PCPU_CFG_GCR)).byte  /* Global configuration register */
#define CPU_CFG_GCR_SWO      (*((volatile DR8*)PCPU_CFG_GCR)).bits.bit0
#define CPU_CFG_GCR_AL       (*((volatile DR8*)PCPU_CFG_GCR)).bits.bit1

//------------------------------------------------------------------------
// ITC - SPR register definitions
//------------------------------------------------------------------------
#define PITC_SPR1            0x7F70
#define ITC_SPR1             (*((volatile DR2222*)PITC_SPR1)).byte  /* Interrupt SW priority register 1 */
#define ITC_SPR1_VECT0SPR    (*((volatile DR2222*)PITC_SPR1)).bit01
#define ITC_SPR1_VECT1SPR    (*((volatile DR2222*)PITC_SPR1)).bit23
#define ITC_SPR1_VECT2SPR    (*((volatile DR2222*)PITC_SPR1)).bit45
#define ITC_SPR1_VECT3SPR    (*((volatile DR2222*)PITC_SPR1)).bit67

#define PITC_SPR2            0x7F71
#define ITC_SPR2             (*((volatile DR2222*)PITC_SPR2)).byte  /* Interrupt SW priority register 2 */
#define ITC_SPR2_VECT4SPR    (*((volatile DR2222*)PITC_SPR2)).bit01
#define ITC_SPR2_VECT5SPR    (*((volatile DR2222*)PITC_SPR2)).bit23
#define ITC_SPR2_VECT6SPR    (*((volatile DR2222*)PITC_SPR2)).bit45
#define ITC_SPR2_VECT7SPR    (*((volatile DR2222*)PITC_SPR2)).bit67

#define PITC_SPR3            0x7F72
#define ITC_SPR3             (*((volatile DR2222*)PITC_SPR3)).byte  /* Interrupt SW priority register 3 */
#define ITC_SPR3_VECT8SPR    (*((volatile DR2222*)PITC_SPR3)).bit01
#define ITC_SPR3_VECT9SPR    (*((volatile DR2222*)PITC_SPR3)).bit23
#define ITC_SPR3_VECT10SPR   (*((volatile DR2222*)PITC_SPR3)).bit45
#define ITC_SPR3_VECT11SPR   (*((volatile DR2222*)PITC_SPR3)).bit67

#define PITC_SPR4            0x7F73
#define ITC_SPR4             (*((volatile DR2222*)PITC_SPR4)).byte  /* Interrupt SW priority register 4 */
#define ITC_SPR4_VECT12SPR   (*((volatile DR2222*)PITC_SPR4)).bit01
#define ITC_SPR4_VECT13SPR   (*((volatile DR2222*)PITC_SPR4)).bit23
#define ITC_SPR4_VECT14SPR   (*((volatile DR2222*)PITC_SPR4)).bit45
#define ITC_SPR4_VECT15SPR   (*((volatile DR2222*)PITC_SPR4)).bit67

#define PITC_SPR5            0x7F74
#define ITC_SPR5             (*((volatile DR2222*)PITC_SPR5)).byte  /* Interrupt SW priority register 5 */
#define ITC_SPR5_VECT16SPR   (*((volatile DR2222*)PITC_SPR5)).bit01
#define ITC_SPR5_VECT17SPR   (*((volatile DR2222*)PITC_SPR5)).bit23
#define ITC_SPR5_VECT18SPR   (*((volatile DR2222*)PITC_SPR5)).bit45
#define ITC_SPR5_VECT19SPR   (*((volatile DR2222*)PITC_SPR5)).bit67

#define PITC_SPR6            0x7F75
#define ITC_SPR6             (*((volatile DR2222*)PITC_SPR6)).byte  /* Interrupt SW priority register 6 */
#define ITC_SPR6_VECT20SPR   (*((volatile DR2222*)PITC_SPR6)).bit01
#define ITC_SPR6_VECT21SPR   (*((volatile DR2222*)PITC_SPR6)).bit23
#define ITC_SPR6_VECT22SPR   (*((volatile DR2222*)PITC_SPR6)).bit45
#define ITC_SPR6_VECT23SPR   (*((volatile DR2222*)PITC_SPR6)).bit67

#define PITC_SPR7            0x7F76
#define ITC_SPR7             (*((volatile DR2222*)PITC_SPR7)).byte  /* Interrupt SW priority register 7 */
#define ITC_SPR7_VECT24SPR   (*((volatile DR2222*)PITC_SPR7)).bit01
#define ITC_SPR7_VECT25SPR   (*((volatile DR2222*)PITC_SPR7)).bit23
#define ITC_SPR7_VECT26SPR   (*((volatile DR2222*)PITC_SPR7)).bit45
#define ITC_SPR7_VECT27SPR   (*((volatile DR2222*)PITC_SPR7)).bit67

#define PITC_SPR8            0x7F77
#define ITC_SPR8             (*((volatile DR2222*)PITC_SPR8)).byte  /* Interrupt SW priority register 8 */
#define ITC_SPR8_VECT28SPR   (*((volatile DR2222*)PITC_SPR8)).bit01
#define ITC_SPR8_VECT29SPR   (*((volatile DR2222*)PITC_SPR8)).bit23

//------------------------------------------------------------------------
// SWIM register definitions
//------------------------------------------------------------------------
#define PSWIM_CSR            0x7F80
#define SWIM_CSR             (*((volatile DR8*)PSWIM_CSR)).byte  /* SWIM control status register */

//------------------------------------------------------------------------
// DM register definitions
//------------------------------------------------------------------------
#define PDM_BK1RE            0x7F90
#define DM_BK1RE             (*((volatile DR8*)PDM_BK1RE)).byte  /* DM breakpoint 1 register extended byte */

#define PDM_BK1RH            0x7F91
#define DM_BK1RH             (*((volatile DR8*)PDM_BK1RH)).byte  /* DM breakpoint 1 register high byte */

#define PDM_BK1RL            0x7F92
#define DM_BK1RL             (*((volatile DR8*)PDM_BK1RL)).byte  /* DM breakpoint 1 register low byte */

#define PDM_BK2RE            0x7F93
#define DM_BK2RE             (*((volatile DR8*)PDM_BK2RE)).byte  /* DM breakpoint 2 register extended byte */

#define PDM_BK2RH            0x7F94
#define DM_BK2RH             (*((volatile DR8*)PDM_BK2RH)).byte  /* DM breakpoint 2 register high byte */

#define PDM_BK2RL            0x7F95
#define DM_BK2RL             (*((volatile DR8*)PDM_BK2RL)).byte  /* DM breakpoint 2 register low byte */

#define PDM_CR1              0x7F96
#define DM_CR1               (*((volatile DR8*)PDM_CR1)).byte    /* DM debug module control register 1 */

#define PDM_CR2              0x7F97
#define DM_CR2               (*((volatile DR8*)PDM_CR2)).byte    /* DM debug module control register 2 */

#define PDM_CSR1             0x7F98
#define DM_CSR1              (*((volatile DR8*)PDM_CSR1)).byte   /* DM debug module control/status register 1 */

#define PDM_CSR2             0x7F99
#define DM_CSR2              (*((volatile DR8*)PDM_CSR2)).byte   /* DM debug module control/status register 2 */

