Emile666/THD_Analyzer/stm8s105.h
#define PDM_ENFCTR           0x7F9A
#define DM_ENFCTR            (*((volatile DR8*)PDM_ENFCTR)).byte /* DM enable function register */

//------------------------------------------------------------------------
// Interrupt numbers, taken from the stm8s105 datasheet. For IAR: add +2.
//------------------------------------------------------------------------
#define AWU_vector                            1 /* AWU Auto Wake up from Halt */
#define CLK_CSS_vector                        2 /* CLK Security System */
#define CLK_SWITCH_vector                     2 /* Master clock switch event */
#define EXTI0_vector                          3 /* EXTI0 Port A external interrupts */
#define EXTI1_vector                          4 /* EXTI1 Port B external interrupts */
#define EXTI2_vector                          5 /* EXTI2 Port C external interrupts */
#define EXTI3_vector                          6 /* EXTI3 Port D external interrupts */
#define EXTI4_vector                          7 /* EXTI4 Port E external interrupts */
#define SPI_CRCERR_vector                    10 /* SPI CRC error interrupt */
#define SPI_MODF_vector                      10 /* SPI Mode fault error interrupt */
#define SPI_OVR_vector                       10 /* SPI Overrun fault error interrupt*/
#define SPI_RXNE_vector                      10 /* SPI Receive buffer not empty error interrupt */
#define SPI_TXE_vector                       10 /* SPI Transmit buffer empty error interrupt */
#define SPI_WKUP_vector                      10 /* SPI Wakeup interrupt */
#define TIM1_OVR_BIF_vector                  11 /* Timer 1 Break interrupt */
#define TIM1_OVR_TIF_vector                  11 /* Timer 1 Trigger interrupt */
#define TIM1_OVR_UIF_vector                  11 /* Timer 1 Update interrupt */
#define TIM1_CAPCOM_CC1IF_vector             12 /* Timer 1 Capture/compare 1 interrupt */
#define TIM1_CAPCOM_CC2IF_vector             12 /* Timer 1 Capture/compare 2 interrupt */
#define TIM1_CAPCOM_CC3IF_vector             12 /* Timer 1 Capture/compare 3 interrupt */
#define TIM1_CAPCOM_CC4IF_vector             12 /* Timer 1 Capture/compare 4 interrupt */
#define TIM1_CAPCOM_COMIF_vector             12 /* Timer 1 Capture/compare 1 interrupt */
#define TIM2_OVR_UIF_vector                  13 /* Timer 2 Update interrupt */
#define TIM3_OVR_UIF_vector                  15 /* Timer 3 Update interrupt */
#define TIM2_CAPCOM_CC1IF_vector             14 /* Timer 2 Capture/compare 1 interrupt */
#define TIM2_CAPCOM_CC2IF_vector             14 /* Timer 2 Capture/compare 2 interrupt */
#define TIM2_CAPCOM_CC3IF_vector             14 /* Timer 2 Capture/compare 3 interrupt */
#define TIM2_CAPCOM_TIF_vector               14 /* Timer 2 Trigger interrupt */
#define TIM3_CAPCOM_CC1IF_vector             16 /* Timer 3 Capture/compare 1 interrupt */
#define TIM3_CAPCOM_CC2IF_vector             16 /* Timer 3 Capture/compare 2 interrupt */
#define TIM3_CAPCOM_CC3IF_vector             16 /* Timer 3 Capture/compare 3 interrupt */
#define TIM3_CAPCOM_TIF_vector               16 /* Timer 3 Trigger interrupt */
#define I2C_ADD10_vector                     19 /* I2C 10-bit header sent interrupt */
#define I2C_ADDR_vector                      19 /* I2C Address sent/matched interrupt */
#define I2C_AF_vector                        19 /* I2C Ack failure interrupt */
#define I2C_ARLO_vector                      19 /* I2C Arbitration loss interrupt */
#define I2C_BERR_vector                      19 /* I2C Bus error interrupt */
#define I2C_BTF_vector                       19 /* I2C Dat byte transfer finished interrupt */
#define I2C_OVR_vector                       19 /* I2C Overrun/underrun interrupt */
#define I2C_RXNE_vector                      19 /* I2C Receive buffer not empty interrupt */
#define I2C_SB_vector                        19 /* I2C Start bit sent interrupt */
#define I2C_STOPF_vector                     19 /* I2C Stop received interrupt */
#define I2C_TXE_vector                       19 /* I2C Transmit buffer empty interrupt */
#define I2C_WUFH_vector                      19 /* I2C Wakeup from Halt interrupt */
#define UART2_T_TC_vector                    20 /* UART Transmission complete interrupt */
#define UART2_T_TXE_vector                   20 /* UART Transmit data register empty interrupt */
#define UART2_R_IDLE_vector                  21 /* UART Idle line detected interrupt */
#define UART2_R_LBDF_vector                  21 /* UART Break flag interrupt */
#define UART2_R_OR_vector                    21 /* UART Overrun detected interrupt */
#define UART2_R_PE_vector                    21 /* UART Parity error interrupt */
#define UART2_R_RXNE_vector                  21 /* UART Received data ready to be read */
#define ADC1_AWDG_vector                     22 /* ADC Analog watchdog interrupt */
#define ADC1_AWS0_vector                     22 /* ADC Interrupt */
#define ADC1_AWS1_vector                     22 /* ADC Interrupt */
#define ADC1_AWS2_vector                     22 /* ADC Interrupt */
#define ADC1_AWS3_vector                     22 /* ADC Interrupt */
#define ADC1_AWS4_vector                     22 /* ADC Interrupt */
#define ADC1_AWS5_vector                     22 /* ADC Interrupt */
#define ADC1_AWS6_vector                     22 /* ADC Interrupt */
#define ADC1_AWS7_vector                     22 /* ADC Interrupt */
#define ADC1_AWS8_vector                     22 /* ADC Interrupt */
#define ADC1_AWS9_vector                     22 /* ADC Interrupt */
#define ADC1_EOC_vector                      22 /* ADC End-of-Conversion interrupt */
#define TIM4_OVR_UIF_vector                  23 /* Timer 4 Update interrupt */
#define FLASH_EOP_vector                     24 /* Flash End-of-Programming interrupt */
#define FLASH_WR_PG_DIS_vector               24 /* Flash Write attempt to protected page interrupt */

#endif /* USE_IAR_HEADER_FILE */
#endif /* _STH8S105_H_ */

//------------------------------------------------------------------------
// End of file
//------------------------------------------------------------------------
